import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/foundation.dart';
import 'package:shared_preferences/shared_preferences.dart';

const _kLocaleStorageKey = '__locale_key__';

class FFLocalizations {
  FFLocalizations(this.locale);

  final Locale locale;

  static FFLocalizations of(BuildContext context) =>
      Localizations.of<FFLocalizations>(context, FFLocalizations)!;

  static List<String> languages() => ['ru', 'mn'];

  static late SharedPreferences _prefs;
  static Future initialize() async =>
      _prefs = await SharedPreferences.getInstance();
  static Future storeLocale(String locale) =>
      _prefs.setString(_kLocaleStorageKey, locale);
  static Locale? getStoredLocale() {
    final locale = _prefs.getString(_kLocaleStorageKey);
    return locale != null && locale.isNotEmpty ? createLocale(locale) : null;
  }

  String get languageCode => locale.toString();
  String? get languageShortCode =>
      _languagesWithShortCode.contains(locale.toString())
          ? '${locale.toString()}_short'
          : null;
  int get languageIndex => languages().contains(languageCode)
      ? languages().indexOf(languageCode)
      : 0;

  String getText(String key) =>
      (kTranslationsMap[key] ?? {})[locale.toString()] ?? '';

  String getVariableText({
    String? ruText = '',
    String? mnText = '',
  }) =>
      [ruText, mnText][languageIndex] ?? '';

  static const Set<String> _languagesWithShortCode = {
    'ar',
    'az',
    'ca',
    'cs',
    'da',
    'de',
    'dv',
    'en',
    'es',
    'et',
    'fi',
    'fr',
    'gr',
    'he',
    'hi',
    'hu',
    'it',
    'km',
    'ku',
    'mn',
    'ms',
    'no',
    'pt',
    'ro',
    'ru',
    'rw',
    'sv',
    'th',
    'uk',
    'vi',
  };
}

/// Used if the locale is not supported by GlobalMaterialLocalizations.
class FallbackMaterialLocalizationDelegate
    extends LocalizationsDelegate<MaterialLocalizations> {
  const FallbackMaterialLocalizationDelegate();

  @override
  bool isSupported(Locale locale) => _isSupportedLocale(locale);

  @override
  Future<MaterialLocalizations> load(Locale locale) async =>
      SynchronousFuture<MaterialLocalizations>(
        const DefaultMaterialLocalizations(),
      );

  @override
  bool shouldReload(FallbackMaterialLocalizationDelegate old) => false;
}

/// Used if the locale is not supported by GlobalCupertinoLocalizations.
class FallbackCupertinoLocalizationDelegate
    extends LocalizationsDelegate<CupertinoLocalizations> {
  const FallbackCupertinoLocalizationDelegate();

  @override
  bool isSupported(Locale locale) => _isSupportedLocale(locale);

  @override
  Future<CupertinoLocalizations> load(Locale locale) =>
      SynchronousFuture<CupertinoLocalizations>(
        const DefaultCupertinoLocalizations(),
      );

  @override
  bool shouldReload(FallbackCupertinoLocalizationDelegate old) => false;
}

class FFLocalizationsDelegate extends LocalizationsDelegate<FFLocalizations> {
  const FFLocalizationsDelegate();

  @override
  bool isSupported(Locale locale) => _isSupportedLocale(locale);

  @override
  Future<FFLocalizations> load(Locale locale) =>
      SynchronousFuture<FFLocalizations>(FFLocalizations(locale));

  @override
  bool shouldReload(FFLocalizationsDelegate old) => false;
}

Locale createLocale(String language) => language.contains('_')
    ? Locale.fromSubtags(
        languageCode: language.split('_').first,
        scriptCode: language.split('_').last,
      )
    : Locale(language);

bool _isSupportedLocale(Locale locale) {
  final language = locale.toString();
  return FFLocalizations.languages().contains(
    language.endsWith('_')
        ? language.substring(0, language.length - 1)
        : language,
  );
}

final kTranslationsMap = <Map<String, Map<String, String>>>[
  // startpage
  {
    'k10p9zpk': {
      'ru': 'Home',
      'mn': '',
    },
  },
  // onboarding
  {
    '31d4gvo3': {
      'ru': 'Добро пожаловать  в NeedNow!',
      'mn': 'NeedNow-д тавтай морилно уу!',
    },
    '3przbxzl': {
      'ru':
          'Находите исполнителей или заказы рядом с Вами. Быстро, удобно  и безопасно!\n',
      'mn':
          'Таны ойролцоо байгаа гүйцэтгэгч эсвэл захиалгыг хурдан, хялбар, аюулгүйгээр хайна уу.',
    },
    '8h7wflks': {
      'ru': 'Далее',
      'mn': 'үргэлжлүүлэх',
    },
    'xt2i2dx3': {
      'ru': 'Доверьтесь нашим профессионалам ',
      'mn': 'Мэргэжлийн гүйцэтгэгчдэд даатгаарай',
    },
    'ajlii5mx': {
      'ru':
          'Проверенные специалисты готовы помочь с Вашими задачами. Выбирайте по рейтингу и отзывам, следите  за выполнением заказа',
      'mn':
          'Баталгаажсан мэргэжилтнүүд таныг хүлээж байна – үнэлгээ, сэтгэгдлээр сонгож, захиалгынхаа явцыг хянаарай',
    },
    '64xxrpta': {
      'ru': 'Далее',
      'mn': 'үргэлжлүүлэх',
    },
    'c3qp59ab': {
      'ru': 'Работа найдёт  Вас сама!',
      'mn': 'Ажил таныг өөрөө олох болно!',
    },
    'q1ntdjyw': {
      'ru':
          'Заполните профиль исполнителя, получайте предложения и начните зарабатывать на любимом деле прямо сейчас!',
      'mn':
          'Гүйцэтгэгчийн профайлаа бөглөөд санал авч, дуртай ажлаараа орлого олоорой!',
    },
    'wqwunvrv': {
      'ru': 'Начать',
      'mn': 'Эхлэх',
    },
    'xtj7iw10': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // enterPhone
  {
    'ij8hy1cy': {
      'ru': 'Введите номер телефоывфаффывана',
      'mn': 'Утасны дугаараа оруулна уу',
    },
    '7ctpbopj': {
      'ru': 'Номер телефона',
      'mn': 'Утасны дугаар',
    },
    'p7xe44yx': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'g4d38mdi': {
      'ru': 'Я прочитал и согласен с ',
      'mn':
          'Би хувийн мэдээлэл боловсруулах дүрэм болон хэрэглэгчийн гэрээг зөвшөөрч баталгаажууллаа.',
    },
    '3pvc91lz': {
      'ru': 'Правилами обработки персональных данных',
      'mn': 'Хувийн мэдээллийг боловсруулах дүрэм',
    },
    'q9ot27hn': {
      'ru': ' и ',
      'mn': 'Тэгээд',
    },
    'oiwbu6au': {
      'ru': 'Пользовательским соглашением',
      'mn': 'Хэрэглэгчийн гэрээ',
    },
    'qjx94918': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'n62lsvgv': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // smsverification
  {
    'gb64xujf': {
      'ru': 'Верификация',
      'mn': 'Баталгаажуулалт',
    },
    'zdu6xv7e': {
      'ru': 'Код был выслан по номеру ',
      'mn': 'Код таны дугаарт илгээгдсэн',
    },
    'bfawlkf3': {
      'ru': 'Неверный код',
      'mn': 'Код буруу байна',
    },
    'uad3vaea': {
      'ru': 'Не получили код?',
      'mn': 'Код хүлээж аваагүй юу?',
    },
    'opdmyqb9': {
      'ru': 'Выслать код ещё раз',
      'mn': 'Код дахин илгээх',
    },
    'mk3pk9nh': {
      'ru': 'Применить',
      'mn': 'Баталгаажуулах',
    },
    '8m2703an': {
      'ru': 'Home',
      'mn': 'Хүүр хуудас',
    },
  },
  // enterEditProfile
  {
    'mz22u0gt': {
      'ru': 'Заполните данные профиля',
      'mn': 'Профайлынхаа дэлгэрэнгүй мэдээллийг бөглөнө үү',
    },
    'bwyaarap': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    'tkr5w4ai': {
      'ru': 'Введите имя',
      'mn': 'Нэрээ оруулна уу',
    },
    'gaf0fucq': {
      'ru': 'Город',
      'mn': 'Хот',
    },
    'wfq2mefu': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '6vdkuuhr': {
      'ru': 'Home',
      'mn': 'Хүүр хуудас',
    },
  },
  // main
  {
    'qijaynu0': {
      'ru': 'Профиль исполнителя',
      'mn': '',
    },
    'eaylkml6': {
      'ru': 'Создайте профиль исполнителя. Начните зарабатывать прямо сейчас!',
      'mn':
          'Гүйцэтгэгчийн профайлаа үүсгээрэй.\nОдоо шууд орлого олж эхлээрэй!',
    },
    'oelssbn7': {
      'ru': 'Создать профиль',
      'mn': 'Профайл үүсгэх',
    },
    'we7rrpka': {
      'ru': 'Мой услуги',
      'mn': 'Миний үйлчилгээ',
    },
    '2llvgqvv': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'rttlqqud': {
      'ru': 'Рекомендуемые заказы',
      'mn': 'Санал болгож буй захиалга',
    },
    'hmasq0yi': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'qcjuulht': {
      'ru': 'Рекомендуемые заказы',
      'mn': 'Санал болгож буй захиалга',
    },
    '08i6l7mj': {
      'ru': 'Поиск по названию',
      'mn': 'Нэрээр нь хайх',
    },
    'marzrtc0': {
      'ru': 'найдено',
      'mn': 'олдсон',
    },
    'dru001d4': {
      'ru': 'Показать на карте',
      'mn': 'Газрын зураг дээр харуулах',
    },
    '0cwmfyel': {
      'ru': 'Показать списком',
      'mn': 'Жагсаалт хэлбэрээр харуулах',
    },
    'pntdqkag': {
      'ru': 'Фильтр',
      'mn': 'Шүүлтүүр',
    },
    'bw5wrprf': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'hyadx5bq': {
      'ru': 'Цена',
      'mn': 'Үнэ',
    },
    'rkre4i3q': {
      'ru': 'Специализация',
      'mn': 'Мэргэжил',
    },
    'bxpm5l2o': {
      'ru': 'Профиль заказчика',
      'mn': 'Хэрэглэгчийн профайл',
    },
    '65lewur7': {
      'ru':
          'Создайте свой первый заказ. А мы подберём для Вас лучшего исполнителя!',
      'mn':
          'Эхний захиалгаа үүсгээрэй.\nБид танд хамгийн сайн гүйцэтгэгчийг олж өгнө!',
    },
    '85ceulnd': {
      'ru': 'Создать профиль',
      'mn': 'Профайл үүсгэх',
    },
    '4hy4ralc': {
      'ru': 'Мой заказы',
      'mn': 'Миний захиалга',
    },
    'q5psjb2v': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    '46xwdi68': {
      'ru': 'Рекомендуемые услуги',
      'mn': 'Санал болгож буй үйлчилгээ',
    },
    's2cus4t6': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    '75mr9i40': {
      'ru': 'Рекомендуемые услуги',
      'mn': 'Санал болгож буй үйлчилгээ',
    },
    'g6n648ep': {
      'ru': 'Поиск по названию',
      'mn': 'Нэрээр нь хайх',
    },
    '3gbrndr2': {
      'ru': 'найдено',
      'mn': 'олдсон',
    },
    'gqj2txbv': {
      'ru': 'Показать на карте',
      'mn': 'Газрын зураг дээр харуулах',
    },
    'hkvt2ix9': {
      'ru': 'Показать списком',
      'mn': 'Жагсаалт хэлбэрээр харуулах',
    },
    'k9dkkbvo': {
      'ru': 'Фильтр',
      'mn': 'Шүүлтүүр',
    },
    'sjs7fsgo': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'iphst066': {
      'ru': 'Цена',
      'mn': 'Үнэ',
    },
    'kluk3j94': {
      'ru': 'Специализация',
      'mn': 'Мэргэжил',
    },
    'ziddft1z': {
      'ru': 'Фильтр',
      'mn': 'Шүүлтүүр',
    },
    'd1oebtoe': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'i8p0slji': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'sy8vcbtz': {
      'ru': 'Option 1',
      'mn': 'Сонголт 1',
    },
    '6qyd4j1a': {
      'ru': 'Радиус от текущего местоположения',
      'mn': 'Одоогийн байршлаас радиус',
    },
    'gmx3ceru': {
      'ru': 'Предоставить доступ к геолокации',
      'mn': 'Гео байршлаа хуваалцах',
    },
    'lkl9orbv': {
      'ru': 'Перейти',
      'mn': 'руу оч',
    },
    'vq6nle2u': {
      'ru': 'Доступ к геолокации получен',
      'mn': 'Гео байршлын зөвшөөрөл олгогдлоо',
    },
    'ymyislu7': {
      'ru': 'Обновить',
      'mn': 'Сэргээх',
    },
    '9a7rhvm1': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    'mulsvv51': {
      'ru': 'От',
      'mn': '-аас',
    },
    'ir1a7too': {
      'ru': 'До',
      'mn': 'руу',
    },
    '412xc5bc': {
      'ru': 'Специализация',
      'mn': 'Мэргэжил',
    },
    '0z5ta0l4': {
      'ru': 'Сбросить',
      'mn': 'Цуцлах',
    },
    'wrlqcq6k': {
      'ru': 'Применить',
      'mn': 'Баталгаажуулах',
    },
    'x84jsn1w': {
      'ru': 'Главная',
      'mn': 'Нүүр хуудас',
    },
  },
  // myJobs
  {
    'smjwd1co': {
      'ru': 'Создать услугу',
      'mn': 'Үйлчилгээ үүсгэх',
    },
    '7mvczjwx': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // Jobs
  {
    '7wt239h4': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    '2zhbmm42': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // myNotification
  {
    't5bbcdk7': {
      'ru': 'Уведомления',
      'mn': 'Мэдэгдэл',
    },
    'p45m66ce': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // MapFilter
  {
    '3k8h37ei': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // SearchResult
  {
    'e4g0dfb0': {
      'ru': 'Поиск по названию',
      'mn': 'Нэрээр нь хайх',
    },
    'yrif6q1b': {
      'ru': 'найдено',
      'mn': 'олдсон',
    },
    'scloio4t': {
      'ru': 'Поиск по названию',
      'mn': 'Нэрээр нь хайх',
    },
    '6mvtzntw': {
      'ru': 'найдено',
      'mn': 'олдсон',
    },
    'wxrk1ihy': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // allFilter
  {
    'rskpkiyw': {
      'ru': 'Фильтр',
      'mn': 'Шүүлтүүр',
    },
    'ei92pre4': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'ptty2dm2': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'lv65615l': {
      'ru': 'Option 1',
      'mn': 'Сонголт 1',
    },
    '5yvm1yug': {
      'ru': 'Радиус от текущего местоположения',
      'mn': 'Одоогийн байршлаас радиус дотор хайх',
    },
    'bs1f9gal': {
      'ru': 'Предоставить доступ к геолокации',
      'mn': 'Гео байршлыг харах эрх олгох',
    },
    'w5nmox3w': {
      'ru': 'Перейти',
      'mn': 'руу оч',
    },
    'vr2ylxqi': {
      'ru': 'Доступ к геолокации получен',
      'mn': 'Байршлын мэдээлэл авах зөвшөөрөл авсан.',
    },
    'yxz59sh5': {
      'ru': 'Обновить',
      'mn': 'Сэргээх',
    },
    'z0aqt85d': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    'a3p5hqa6': {
      'ru': 'От',
      'mn': '-аас',
    },
    'k048syv3': {
      'ru': 'До',
      'mn': 'руу',
    },
    'ckwzp0th': {
      'ru': 'Специализация',
      'mn': 'Мэргэшил',
    },
    'xiws0avc': {
      'ru': 'Сбросить',
      'mn': 'Цуцлах',
    },
    'etc4lbzr': {
      'ru': 'Применить',
      'mn': 'Баталгаажуулах',
    },
    '5eykjom4': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // getOrder
  {
    '9c0f4tlo': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'nw6d7bny': {
      'ru': 'Срок выполнения работы (кол-во дней)',
      'mn': 'Дуусах огноо (өдрийн тоо)',
    },
    'nmbfrkad': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'wu81inn5': {
      'ru': 'Сопроводительное письмо',
      'mn': 'Хавсралт',
    },
    'jqi02hcb': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'reh8l8eb': {
      'ru': 'Отправить',
      'mn': 'Илгээх',
    },
    'szftjxuw': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // createServiceStart
  {
    'ndde3s5r': {
      'ru': 'Добавьте свои услуги',
      'mn': 'Өөрийн үйлчилгээг нэмнэ үү',
    },
    'lwsd33si': {
      'ru':
          'Расскажите подробнее,  что вы предлагаете. Это привлечёт внимание заказчиков. Для успешного заполнения профиля нужно добавить хотя бы одну услугу',
      'mn':
          'Өөрийн санал болгож буй үйлчилгээгээ дэлгэрэнгүй бичнэ үү, ингэснээр захиалагчдын анхаарлыг татах болно. Амжилттай профайл үүсгэхийн тулд дор хаяж нэг үйлчилгээг заавал нэмнэ үү',
    },
    'mjfkf88q': {
      'ru': 'Создать услугу',
      'mn': 'Үйлчилгээ үүсгэх',
    },
    'mw86mai7': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '1ku0vcnu': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // createService
  {
    'rqa1gma2': {
      'ru': 'Локация услуги',
      'mn': 'Үйлчилгээний байршил',
    },
    'd8kpyymf': {
      'ru':
          'Укажите, где вы оказываете услугу.  Если услуга выполняется удалённо, отметьте это',
      'mn':
          'Та хаана үйлчилгээ үзүүлэхээ зааж өгнө үү. Хэрэв үйлчилгээг алсаас гүйцэтгэж байгаа бол үүнийг зааж өгнө үү',
    },
    '2ebr6yds': {
      'ru': 'Удалённо',
      'mn': 'Алсын зайнаас',
    },
    'e7cplqa8': {
      'ru': 'Локация заказа',
      'mn': 'Захиалгын байршил',
    },
    'ta8zl8hy': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'fw5p2ak5': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '3kgvt7ez': {
      'ru': 'Название услуги',
      'mn': 'Үйлчилгээний нэр',
    },
    'zbuj3kwk': {
      'ru':
          'Придумайте краткое и понятное название услуги, чтобы заказчики сразу поняли её суть, например, “Чистовая отделка квартир”',
      'mn':
          'Үйлчилгээний мөн чанарыг нэн даруй ойлгохын тулд үйлчилгээний товч бөгөөд тодорхой нэрийг гаргаж ирээрэй, жишээлбэл, \"Орон сууцны нарийн өнгөлгөө\"',
    },
    'uxm7d4bo': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '19e34dn6': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '6u02che5': {
      'ru': 'Специализация',
      'mn': 'Мэргэшил',
    },
    'xg7w2iz5': {
      'ru': 'Выберите категорию, к которой относится ваша услуга',
      'mn': 'Үйлчилгээнийхээ ангилалыг сонгоно уу.',
    },
    '5taig0ky': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'z4vjczy1': {
      'ru': 'Стоимость работы',
      'mn': 'Ажлын өртөг',
    },
    'juh54zx5': {
      'ru': 'Укажите сумму, за которую Вы готовы оказать услугу',
      'mn':
          'Та энэ үйлчилгээг ямар үнээр үзүүлэхэд бэлэн байгаагаа оруулна уу.',
    },
    '6fnqllwa': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'ou91dwdb': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'iqk2sneq': {
      'ru': 'Описание услуги',
      'mn': 'Үйлчилгээний тодорхойлолт',
    },
    'uqweqrdt': {
      'ru':
          'Расскажите подробнее о вашей услуге: что именно входит в работу, в чём ваши преимущества, какие материалы  или технологии используете',
      'mn':
          'Өөрийн үйлчилгээний талаар дэлгэрэнгүй бичнэ үү: яг ямар ажлууд багтаж байгаа, таны давуу тал юу вэ, ямар материал эсвэл технологи ашигладаг вэ.',
    },
    'n5ntxolj': {
      'ru': 'Описание услуги',
      'mn': 'Үйлчилгээний тайлбар',
    },
    't20t6s6f': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '0xeavyc4': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '0xbuwafm': {
      'ru': 'Фотографии',
      'mn': 'Зураг',
    },
    '3v3xqwpu': {
      'ru':
          'Добавьте примеры ваших работ  или демонстрационные материалы. Это повысит доверие заказчиков и поможет им оценить качество ваших услуг',
      'mn':
          'Өөрийн хийсэн ажлын жишээ эсвэл танилцуулгын материалыг нэмээрэй. Энэ нь захиалагчдын итгэлийг нэмэгдүүлж, таны үйлчилгээний чанарыг үнэлэхэд тусална.',
    },
    '1esmdzvd': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '67avz79i': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // workerKYC
  {
    'hhsfl3um': {
      'ru': 'Проверка личности',
      'mn': 'Хувийн мэдээлэл баталгаажуулалт',
    },
    '0mw100zg': {
      'ru': 'Для повышения доверия заказчиков пройдите верификацию личности',
      'mn':
          'Хэрэглэгчийн итгэлийг нэмэгдүүлэхийн тулд хэн болохыг баталгаажуулна уу',
    },
    '3ghcxv71': {
      'ru': 'Загрузите фото паспорта',
      'mn': 'Иргэний үнэмлэхний зургийг байршуулна уу',
    },
    'c4ioa50p': {
      'ru': 'Загрузить',
      'mn': 'Байршуулах',
    },
    'bt2snxuh': {
      'ru': 'Загрузите фото с паспортом',
      'mn': 'Иргэний үнэмлэхний зургийг байршуулна уу',
    },
    '8x13hbw6': {
      'ru': 'Загрузить',
      'mn': 'Байршуулах',
    },
    'eu1f7qk5': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'klpwp6em': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // workerKYCedit
  {
    '6bddpx54': {
      'ru': 'Редактировать\nПрофиль исполнителя',
      'mn': 'Гүйцэтгэгчийн профайлыг засах',
    },
    'ogp0etjw': {
      'ru': 'Проверка личности',
      'mn': 'Хувийн мэдээлэл баталгаажуулалт',
    },
    'yollz6um': {
      'ru': 'Фото паспорта',
      'mn': 'Иргэний үнэмлэхний зураг',
    },
    'ftogh5e1': {
      'ru': 'Фото с паспортом',
      'mn': 'Паспорттой зураг',
    },
    'iw2e9ryi': {
      'ru': 'Отменить',
      'mn': 'Цуцлах',
    },
    '5xqr4o50': {
      'ru': 'Отправить',
      'mn': 'Илгээх',
    },
    'kri04oi8': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // Reviews
  {
    'y21hq0f4': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    'dbcml02w': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    'inv15zlu': {
      'ru': '5',
      'mn': '5',
    },
    'm2xmmxru': {
      'ru': '4',
      'mn': '4',
    },
    'ot6nv86b': {
      'ru': '3',
      'mn': '3',
    },
    'dre43ny8': {
      'ru': '2',
      'mn': '2',
    },
    'f2yirg3p': {
      'ru': '1',
      'mn': '1',
    },
    '1bgn2ez6': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // myProfile
  {
    'zoiurosn': {
      'ru': 'Профиль исполнителя',
      'mn': 'Гүйцэтгэгчийн профайл',
    },
    'xqjob953': {
      'ru':
          'Создайте профиль исполнителя. \nНачните зарабатывать прямо сейчас!',
      'mn': 'Гүйцэтгэгчийн профайл үүсгээд одооноос орлогоо нэмэгдүүлээрэй!',
    },
    'eqych3da': {
      'ru': 'Создать профиль',
      'mn': 'Профайл нээх',
    },
    'otill84q': {
      'ru': 'Профиль исполнителя \nактивен',
      'mn': 'Гүйцэтгэгчийн профайл \nидэвхтэй',
    },
    'e5unc77o': {
      'ru': 'Вы можете предлагать свои услуги!',
      'mn': 'Та үйлчилгээгээ санал болгож болно!',
    },
    '2li0o1ge': {
      'ru': 'Ок, убрать уведомление',
      'mn': 'Ок, мэдэгдлийг арилгах',
    },
    '5c2v1hgf': {
      'ru': 'Профиль',
      'mn': 'Профайл',
    },
    'p8mpmdp5': {
      'ru': 'Завершено заказов',
      'mn': 'Дууссан захиалга',
    },
    'z61es34s': {
      'ru': 'Рейтинг по отзывам',
      'mn': 'Сэтгэгдлээр үнэлэх',
    },
    'tldn2tq6': {
      'ru': 'Профиль заказчика',
      'mn': 'Захиалагчийн профайл',
    },
    'y6h04gg0': {
      'ru':
          'Создайте свой первый заказ. А мы подберём \nдля Вас лучшего исполнителя!',
      'mn':
          'Эхний захиалгаа үүсгээрэй. Бид танд хамгийн шилдэг гүйцэтгэгчийг сонгож өгнө!',
    },
    'enby2k4q': {
      'ru': 'Создать заказ',
      'mn': 'Захиалга үүсгэх',
    },
    '06wd7b4u': {
      'ru': 'Профиль',
      'mn': 'Профайл',
    },
    'nk8m4i3u': {
      'ru': 'Завершено заказов',
      'mn': 'Дууссан захиалга',
    },
    'hqkdhpkn': {
      'ru': 'Рейтинг по отзывам',
      'mn': 'Сэтгэгдлээр үнэлэх',
    },
    'i1u7d18g': {
      'ru': 'Сумма заказов',
      'mn': 'Захиалгын хэмжээ',
    },
    '021nc8ov': {
      'ru': 'Данные профиля',
      'mn': 'Профайлын мэдээлэл',
    },
    'pk6akklw': {
      'ru': 'История заказов',
      'mn': 'Захиалгын түүх',
    },
    'iyylto8k': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    'nuw83qdn': {
      'ru': 'Ваш баланс',
      'mn': 'Таны үлдэгдэл',
    },
    'kfgygb7p': {
      'ru': 'PUSH-уведомления',
      'mn': 'PUSH мэдэгдэл',
    },
    'lkbxeum1': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // EditProfile
  {
    'gcguqikw': {
      'ru': 'Данные профиля',
      'mn': 'Профайлын мэдээлэл',
    },
    '6nc9evdx': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    'lup7d42r': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'cuetihbo': {
      'ru': 'Город',
      'mn': 'Хот',
    },
    'clrqki8t': {
      'ru': 'Удалить аккаунт',
      'mn': 'Бүртгэл устгах',
    },
    'sbe89ayl': {
      'ru': 'Выйти из аккаунта',
      'mn': 'Гарах',
    },
    'fh8xcbjr': {
      'ru': 'Сохранить',
      'mn': 'Хадгалах',
    },
    'hi215qci': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // myBalance
  {
    '6hlbuo4b': {
      'ru': 'Ваш баланс',
      'mn': 'Таны үлдэгдэл',
    },
    'athqhw3l': {
      'ru': 'Ваш баланс',
      'mn': 'Таны үлдэгдэл',
    },
    'qye424fk': {
      'ru': 'Пополнить',
      'mn': 'Цэнэглэх',
    },
    'g57sr9wn': {
      'ru': 'Вывести',
      'mn': 'Гаргах',
    },
    'gdch8fq7': {
      'ru': 'История транзакций',
      'mn': 'Гүйлгээний түүх',
    },
    'pi6b1b54': {
      'ru': 'Заработано за все время',
      'mn': 'Бүх цаг хугацаанд олсон',
    },
    'qrtzhdri': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // Income
  {
    '43ye7avt': {
      'ru': 'Пополнить',
      'mn': 'Цэнэглэх',
    },
    'o7njtdao': {
      'ru': 'Пополнить',
      'mn': 'Цэнэглэх',
    },
    'u58xocca': {
      'ru': 'Ваш баланс',
      'mn': 'Таны үлдэгдэл',
    },
    '4od60ih8': {
      'ru': 'Сумма пополнения',
      'mn': 'Цэнэглэсэн дүн',
    },
    'ktznt9pk': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '7ocgfl1s': {
      'ru': 'Пополнить',
      'mn': 'Цэнэглэх',
    },
    'mgej9w4o': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // Outcome
  {
    '5rh3gpwh': {
      'ru': 'Вывести',
      'mn': 'Гаргаж авах',
    },
    'cn0hlwy1': {
      'ru': 'Вывести',
      'mn': 'Гаргаж авах',
    },
    '6hrdhxv5': {
      'ru': 'Ваш баланс',
      'mn': 'Таны үлдэгдэл',
    },
    'h3xk9umc': {
      'ru': 'Сумма вывода',
      'mn': 'Гаргах дүн',
    },
    'xeypwbto': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'l4umzul8': {
      'ru': 'Вывести',
      'mn': 'Гаргаж авах',
    },
    'dcpbhto9': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // chatList
  {
    'f0d04n33': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    '1x1vqdht': {
      'ru': 'Открыт спор',
      'mn': 'Маргаан нээгдсэн',
    },
    'srry61ld': {
      'ru': 'Закрыт спор',
      'mn': 'Маргаан хаагдсан',
    },
    'idpshp4q': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // chatWindow
  {
    '4lwrmjch': {
      'ru': 'Дата окончания',
      'mn': 'Дуусах огноо',
    },
    'l1nafdle': {
      'ru': 'Документ',
      'mn': 'Баримт бичиг',
    },
    '85q46ni2': {
      'ru': 'Камера',
      'mn': 'Камер',
    },
    'hnb61xpf': {
      'ru': 'Галерея',
      'mn': 'Галерей',
    },
    'tomowgmn': {
      'ru': '',
      'mn': '',
    },
    'svqvd7tv': {
      'ru': 'Напишите...',
      'mn': 'Бичих...',
    },
    'lyhoa6cu': {
      'ru': 'Home',
      'mn': 'Гэр',
    },
  },
  // adminPageLogin
  {
    'qt2a37v8': {
      'ru': 'Нет аккаунта?',
      'mn': 'Бүртгэлгүй юу?',
    },
    'alk2cgpl': {
      'ru': 'Регистрация',
      'mn': 'Бүртгэл',
    },
    'bwfm8uti': {
      'ru': 'Войти',
      'mn': 'Нэвтрэх',
    },
    '28gwwkiw': {
      'ru': 'Email',
      'mn': 'Имэйл',
    },
    '0xo2dnh2': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'k21qr4mv': {
      'ru': 'Пароль',
      'mn': 'Нууц үг',
    },
    'oo4pdt35': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'dvwy9djr': {
      'ru': 'Забыли пароль?',
      'mn': 'Нууц үгээ мартсан уу?',
    },
    't0au0chw': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '9c6jtfk1': {
      'ru': 'Я прочитал и согласен с ',
      'mn': 'Би уншсан, санал нийлж байна',
    },
    '6l5uzbcb': {
      'ru': 'Правилами обработки персональных данных',
      'mn': 'Хувийн мэдээллийг боловсруулах дүрэм',
    },
    'e5oskbw8': {
      'ru': ' и ',
      'mn': 'Тэгээд',
    },
    'vvetewbv': {
      'ru': 'Пользовательским соглашением',
      'mn': 'Хэрэглэгчийн гэрээ',
    },
    'bjf0l7uh': {
      'ru': 'Home',
      'mn': 'Гэр',
    },
  },
  // ServiceDetails
  {
    'i9avc6ki': {
      'ru': 'С предложениями',
      'mn': 'Саналуудаар',
    },
    'xddreshq': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    'a2zygw38': {
      'ru': 'Специализация',
      'mn': 'Мэргэжил',
    },
    'zx4nr0l5': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'zfwzw3i3': {
      'ru': 'Предложить заказ',
      'mn': 'Захиалга санал болгох',
    },
    'mhv9k7yi': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // workPage
  {
    'x9k36eg0': {
      'ru': 'Заказ',
      'mn': 'Захиалга',
    },
    'mvvc7siu': {
      'ru': 'Заказ',
      'mn': 'Захиалга',
    },
    'rhnt4kqz': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    'lw5caezd': {
      'ru': 'Специализация',
      'mn': 'Мэргэшил',
    },
    'knpy7dz2': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'hj70z6ch': {
      'ru': 'Срок выполнения',
      'mn': 'Дуусах огноо',
    },
    'en7811ql': {
      'ru': 'Чат по заказу',
      'mn': 'Хүсэлтийн дагуу чатлах',
    },
    'ogr1kyi4': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    'gxrv4gfl': {
      'ru': 'Срок выполнения',
      'mn': 'Дуусах огноо',
    },
    'wxxuvxfk': {
      'ru': 'Детали заказа',
      'mn': 'Захиалгын дэлгэрэнгүй мэдээлэл',
    },
    '81w8srd1': {
      'ru': 'Заказчик',
      'mn': 'Хэрэглэгч',
    },
    'r14eg9ot': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    '0moxt4ms': {
      'ru': 'Дата окончания',
      'mn': 'Дуусах огноо',
    },
    'ksrugcoe': {
      'ru': 'Способ оплаты',
      'mn': 'Төлбөрийн арга',
    },
    'v7m8stfw': {
      'ru': 'Отклонить',
      'mn': 'Татгалзах',
    },
    '1gi8yhp4': {
      'ru': 'Откликнуться',
      'mn': 'Хариулах',
    },
    '0tpp78lg': {
      'ru': 'Подтвердить завершение',
      'mn': 'Дууссаныг батлах',
    },
    'uf6st8hq': {
      'ru': 'Отклонить',
      'mn': 'Татгалзах',
    },
    '87lhm8cd': {
      'ru': 'Подтвердить',
      'mn': 'Баталгаажуулах',
    },
    'b4afh53h': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // enterLocationCity
  {
    'ptpl9bg6': {
      'ru': 'Введите город',
      'mn': 'Хот оруулна уу',
    },
    'yw9r3hki': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'cfm4vbac': {
      'ru': 'Применить',
      'mn': 'Өргөдөл гаргах',
    },
    'eh2nwuis': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // myWorkHistory
  {
    'no8lvjnl': {
      'ru': 'История заказов',
      'mn': 'Захиалгын түүх',
    },
    '5it3ytw0': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // takeReview
  {
    'rkr0pncy': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    'of6w8tqc': {
      'ru': 'Рейтинг',
      'mn': 'Үнэлгээ',
    },
    'gotc7y3h': {
      'ru': 'Ваш отзыв',
      'mn': 'Таны сэтгэгдэл',
    },
    'exmk1wpn': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'fxjs8wve': {
      'ru': 'Отменить',
      'mn': 'Цуцлах',
    },
    'phpxaou3': {
      'ru': 'Отправить',
      'mn': 'Илгээх',
    },
    '2oeyffji': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // enterLocationAdress
  {
    'azndwub6': {
      'ru': 'Введите локацию',
      'mn': 'Байршлыг оруулна уу',
    },
    'hmzqa7fc': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '6pqdud4u': {
      'ru': 'Option 1',
      'mn': 'Сонголт 1',
    },
    'ak3w4gef': {
      'ru': 'Применить',
      'mn': 'Өргөдөл гаргах',
    },
    '3wenl6da': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // editService
  {
    'fzjclvlg': {
      'ru': 'Редактировать услугу',
      'mn': 'Үйлчилгээг засах',
    },
    '5p45bskp': {
      'ru': 'Локация услуги',
      'mn': 'Үйлчилгээний байршил',
    },
    'ochpjxr4': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'cog58swt': {
      'ru': 'Удалённо',
      'mn': 'Алсын зайнаас',
    },
    '9cy8sqou': {
      'ru': 'Название услуги',
      'mn': 'Үйлчилгээний нэр',
    },
    '6uboecpo': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'y6hd2zzp': {
      'ru': 'Специализация',
      'mn': 'Мэргэшил',
    },
    'r6pd430v': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'wfua70bj': {
      'ru': 'Описание услуги',
      'mn': 'Үйлчилгээний тайлбар',
    },
    'q3xggsqz': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'gdoz76sp': {
      'ru': 'Сохранить',
      'mn': 'Хадгалах',
    },
    'syl9hkqu': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // approvedWorker
  {
    'fvy2b8it': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    'kktxshz0': {
      'ru': 'Сопроводительное письмо',
      'mn': 'Хавсралт',
    },
    'gpxzd0hn': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '8xegal63': {
      'ru': 'Способ оплаты',
      'mn': 'Төлбөрийн арга',
    },
    '4qdtzv1b': {
      'ru': 'Безопасная сделка',
      'mn': 'Эрсдэлгүй хэлцэл',
    },
    'w3uhsnic': {
      'ru': 'По факту выполнения заказа',
      'mn': 'Захиалга дууссаны дараа',
    },
    'y307lqmx': {
      'ru': 'Отменить',
      'mn': 'Цуцлах',
    },
    'f311rn02': {
      'ru': 'Подтвердить',
      'mn': 'Баталгаажуулах',
    },
    '11967dzu': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // orderDetails
  {
    'ppi05ob7': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    '7pyl7j0y': {
      'ru': 'Специализация',
      'mn': 'Мэргэшил',
    },
    '2mlkbzpr': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'lu0or17a': {
      'ru': 'Срок выполнения (дни)',
      'mn': 'Дуусах хугацаа (өдөр)',
    },
    'r0lmr3qu': {
      'ru': 'Примечание',
      'mn': 'Анхаарна уу',
    },
    'b7wvdafp': {
      'ru': 'Откликнуться',
      'mn': 'Хариулах',
    },
    'hnskhnsh': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // editOrder
  {
    'yhoivwbe': {
      'ru': 'Редактировать заказ',
      'mn': 'Захиалга засах',
    },
    'b86bw83m': {
      'ru': 'Локация заказа',
      'mn': 'Захиалгын байршил',
    },
    '7cjt6iul': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'frm0wzvh': {
      'ru': 'Удалённо',
      'mn': 'Алсын зайнаас',
    },
    'ksw81xny': {
      'ru': 'Название заказа',
      'mn': 'Захиалгын нэр',
    },
    'hswpxsud': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'j9cp6tc2': {
      'ru': 'Специализация',
      'mn': 'Мэргэшил',
    },
    'cw10gqnz': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '3ektlx68': {
      'ru': 'Сроки выполнения (дни)',
      'mn': 'Дуусах хугацаа (өдөр)',
    },
    '0fr6af3y': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'fu379fq3': {
      'ru': 'Описание услуги',
      'mn': 'Үйлчилгээний тодорхойлолт',
    },
    'xcfyho39': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '1eivyrld': {
      'ru': 'Примечание',
      'mn': 'Анхаарна уу',
    },
    'gsv8v758': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'y48y8ef3': {
      'ru': 'Сохранить',
      'mn': 'Хадгалах',
    },
    'i2833pd4': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // createOrder
  {
    'xqcfv4eo': {
      'ru': 'Локация заказа',
      'mn': 'Захиалгын байршил',
    },
    '471f5o8v': {
      'ru':
          'Укажите место, где необходимо выполнить заказ. Если работа удалённая, отметьте это',
      'mn':
          'Захиалгыг бөглөх ёстой газрыг зааж өгнө үү. Хэрэв ажил алслагдсан бол тэмдэглэнэ үү',
    },
    '661ipvg5': {
      'ru': 'Удалённо',
      'mn': 'Алсын зайнаас',
    },
    'joanpwz6': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'ym6hl1dd': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'n9kls1sl': {
      'ru': 'Название заказа',
      'mn': 'Захиалгын нэр',
    },
    'lmml0cl0': {
      'ru':
          'Придумайте краткое и понятное название заказа, чтобы исполнители сразу поняли его суть, например, “Чистовая отделка квартир”',
      'mn':
          'Захиалгын товч бөгөөд тодорхой нэрийг гаргаж ирээрэй, ингэснээр жүжигчид түүний мөн чанарыг шууд ойлгох болно, жишээлбэл, \"Орон сууцны нарийн өнгөлгөө\"',
    },
    'r9p6iuua': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'pt78kc9s': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'b2aaaof4': {
      'ru': 'Сроки выполнения ',
      'mn': 'Дуусах огноо',
    },
    'lg7kdod2': {
      'ru': 'Задайте срок выполнения работы',
      'mn': 'Ажлын эцсийн хугацааг тогтоо',
    },
    '3axuyynu': {
      'ru': 'Сроки выполнения (дни)',
      'mn': 'Дуусах хугацаа (өдөр)',
    },
    '166l48fh': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '0wqfnerh': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'fcrjsey7': {
      'ru': 'Специализация',
      'mn': 'Мэргэжил',
    },
    'hhn3vtbo': {
      'ru': 'Выберите категорию, к которой относится ваш заказ',
      'mn': 'Захиалах ангилалаа сонгоно уу',
    },
    'q2inwuqw': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'xrpg39dl': {
      'ru': 'Стоимость работы',
      'mn': 'Ажлын өртөг',
    },
    '20k9n46n': {
      'ru': 'Укажите сумму, которую вы готовы заплатить за выполнение заказа',
      'mn': 'Захиалгыг дуусгахын тулд төлөхөд бэлэн байгаа дүнг зааж өгнө үү',
    },
    '80016x8z': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '37mx0606': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'ce8pgss5': {
      'ru': 'Описание заказа',
      'mn': 'Захиалгын тодорхойлолт',
    },
    'g6e7akbs': {
      'ru': 'Подробно опишите, что нужно сделать',
      'mn': 'Юу хийх ёстойг нарийвчлан тайлбарлана уу',
    },
    'wd1qy9k6': {
      'ru': 'Описание заказа',
      'mn': 'Захиалгын тодорхойлолт',
    },
    '6da36hug': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'jr8mvnng': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'oonudb7q': {
      'ru': 'Фотографии',
      'mn': 'Зураг',
    },
    '82l0crcd': {
      'ru':
          'Добавьте примеры ваших работ  или демонстрационные материалы. Это повысит доверие заказчиков и поможет им оценить качество ваших услуг',
      'mn':
          'Өөрийн хийсэн ажлын жишээ эсвэл танилцуулгын материалыг нэмээрэй. Энэ нь захиалагчдын итгэлийг нэмэгдүүлж, таны үйлчилгээний чанарыг үнэлэхэд тусална.',
    },
    'nm9ghlgj': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '5a9235o1': {
      'ru': 'Примечание',
      'mn': 'Анхаарна уу',
    },
    'hfboxvy1': {
      'ru':
          'Дополнительная информация, которая может быть полезна исполнителю. \nНапример, особые требования, нюансы работы или предпочтения по времени связи',
      'mn':
          'Гүйцэтгэгчид хэрэг болох нэмэлт мэдээлэл. Жишээлбэл, тусгай шаардлагууд, ажлын онцлог нөхцөл эсвэл холбогдох цагийн давуу эрх.',
    },
    '4xf80l3m': {
      'ru': 'Примечание',
      'mn': 'Анхаарна уу',
    },
    'ejuh2s1l': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'cfy84q8l': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'chacf11e': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // offerOrder
  {
    'mn9xjmwt': {
      'ru': 'Предложить заказ',
      'mn': 'Захиалга санал болгох',
    },
    '9z3qfsh6': {
      'ru': 'Выбрать заказ',
      'mn': 'Захиалга сонгоно уу',
    },
    'ha2aagv1': {
      'ru': 'Сопроводительное письмо',
      'mn': 'Хавсралт',
    },
    'k94dkclq': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'st54c8p9': {
      'ru': 'Отправить',
      'mn': 'Илгээх',
    },
    'e0920zhr': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // chooseOrderToOff
  {
    'da1js303': {
      'ru': 'Применить',
      'mn': 'Өргөдөл гаргах',
    },
    'grgurmyl': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // reviewWithJobs
  {
    'k4n3c2af': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    'ua2ledqa': {
      'ru': 'Заказы',
      'mn': 'Захиалга',
    },
    'p6pc6yya': {
      'ru': 'Заказы',
      'mn': 'Захиалга',
    },
    'frtt2k2t': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // deniedWorker
  {
    '75kj47uv': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    '23zci4ii': {
      'ru': 'Сопроводительное письмо',
      'mn': 'Хавсралт ',
    },
    '2s544hmk': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '8hq90vah': {
      'ru': 'Отменить',
      'mn': 'Цуцлах',
    },
    '1jnz48y7': {
      'ru': 'Отклонить',
      'mn': 'Татгалзах',
    },
    'aargsa30': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // enterLocationCityStart
  {
    'twkoa4d3': {
      'ru': 'Введите город',
      'mn': 'Хот оруулна уу',
    },
    'laoah1yk': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'fogx90kb': {
      'ru': 'Применить',
      'mn': 'Өргөдөл гаргах',
    },
    'nkwmagk5': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // adminMainProfile
  {
    'p3dgay2x': {
      'ru': 'Профиль',
      'mn': 'Профайл',
    },
    'tizk7enj': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    'ckz931av': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'mci2181h': {
      'ru': 'Сохранить',
      'mn': 'Хадгалах',
    },
    'rz1xz7fu': {
      'ru': 'Расмер комиссии',
      'mn': 'Шимтгэлийн хэмжээ',
    },
    'l7r53g31': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'f9k2k27o': {
      'ru': 'ВНИМАНИЕ! Размер комиссии изменится для всех пользователей',
      'mn': 'Шимтгэлийн хэмжээ бүх хэрэглэгчдэд өөрчлөгдөнө.',
    },
    'igzlu3wa': {
      'ru': 'Изменить',
      'mn': 'Өөрчлөх',
    },
    'capqss1u': {
      'ru': 'Выйти из аккаунта',
      'mn': 'Гарах',
    },
    'uo5g9jz1': {
      'ru': 'Удалить аккаунт',
      'mn': 'Бүртгэл устгах',
    },
    'qdgi5fa2': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // adminPageRegistration
  {
    '1d5sxmwz': {
      'ru': 'Есть аккаунт?',
      'mn': 'Та данстай юу?',
    },
    'ets9euvm': {
      'ru': 'Войти',
      'mn': 'Нэвтрэх',
    },
    'jkajjsjy': {
      'ru': 'Регистрация',
      'mn': 'Бүртгэл',
    },
    'uc7ujasu': {
      'ru': 'Email',
      'mn': 'Имэйл',
    },
    'cein13xq': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'ev4xd0nr': {
      'ru': 'Пароль',
      'mn': 'Нууц үг',
    },
    'aq9rycmn': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '4udcxzi0': {
      'ru': 'Повторите пароль',
      'mn': 'Нууц үгийг давт',
    },
    'yfv5o5xe': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '3ub3cyd7': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    '49ik4879': {
      'ru': 'Я прочитал и согласен с ',
      'mn': 'Би уншсан, санал нийлж байна',
    },
    'lxl6s29n': {
      'ru': 'Правилами обработки персональных данных',
      'mn':
          'Хэрэглэгч нь Хувийн мэдээлэл боловсруулах журам-тай санал нийлж байна',
    },
    'bjymkheu': {
      'ru': ' и ',
      'mn': 'Тэгээд',
    },
    'qdqgzzeo': {
      'ru': 'Пользовательским соглашением',
      'mn': 'Хэрэглэгчийн гэрээ',
    },
    'qejy3g8z': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // adminEmploee
  {
    '4z3dfgvv': {
      'ru': 'Сотрудники',
      'mn': 'Ажилчид',
    },
    'mvfghstp': {
      'ru': 'Сотрудники',
      'mn': 'Ажилчид',
    },
    'vr8x4z9b': {
      'ru': 'Поиск',
      'mn': 'Хайх',
    },
    '9r96kfmx': {
      'ru': 'Статус',
      'mn': 'Статус',
    },
    'hhq531z0': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'ig59th7f': {
      'ru': 'Search...',
      'mn': 'Хайх...',
    },
    'i149hpay': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'fcs5q6rc': {
      'ru': 'Заблокирован',
      'mn': 'Блоклосон',
    },
    's10mt3u2': {
      'ru': 'Активен',
      'mn': 'Идэвхтэй',
    },
    'p4im7q2c': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    'f1fxdn2n': {
      'ru': 'Роль',
      'mn': 'Үүрэг',
    },
    'eca0msvi': {
      'ru': 'Задачи',
      'mn': 'Даалгаврууд',
    },
    'f8nr942i': {
      'ru': 'Статус',
      'mn': 'Статус',
    },
    'sephj6dp': {
      'ru': 'Заявки',
      'mn': 'Хэрэглээ',
    },
    '7zncg03u': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    '0jf7gu41': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    'fctgbyqz': {
      'ru': 'Отклонить',
      'mn': 'Татгалзах',
    },
    '6sb6wwld': {
      'ru': 'Подтвердить',
      'mn': 'Баталгаажуулах',
    },
    'n2uxv37p': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // adminCategory
  {
    'zqgziqs8': {
      'ru': 'Категории',
      'mn': 'Ангилал',
    },
    '769lzc5m': {
      'ru': 'Поиск',
      'mn': 'Хайх',
    },
    'i7g4hli7': {
      'ru': 'Создать категорию',
      'mn': 'Ангилал үүсгэх',
    },
    '1sujmccf': {
      'ru': 'Категория',
      'mn': 'Ангилал',
    },
    'fcahska1': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // adminUsers
  {
    'wfppqk2y': {
      'ru': 'Пользователи',
      'mn': 'Хэрэглэгчид',
    },
    'hvfx1wpk': {
      'ru': 'Пользователи',
      'mn': 'Хэрэглэгчид',
    },
    'gmstuopv': {
      'ru': 'Поиск',
      'mn': 'Хайх',
    },
    '3a4s8na3': {
      'ru': 'Статус',
      'mn': 'Статус',
    },
    'nsq983r9': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'yk1vaebe': {
      'ru': 'Search...',
      'mn': 'Хайх...',
    },
    'mx7wad8z': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'dcu12v12': {
      'ru': 'Заблокирован',
      'mn': 'Блоклосон',
    },
    'kz11i3pj': {
      'ru': 'Активен',
      'mn': 'Идэвхтэй',
    },
    'p0zwsjhl': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    'cbqm94iu': {
      'ru': 'Дата регистрации',
      'mn': 'Бүртгүүлсэн огноо',
    },
    'ssjt4zcv': {
      'ru': 'Контактные данные',
      'mn': 'Холбоо барих мэдээлэл',
    },
    'at28fq6y': {
      'ru': 'Статус',
      'mn': 'Статус',
    },
    'mpf5qsnz': {
      'ru': 'Профиль',
      'mn': 'Профайл',
    },
    '56jfkwyj': {
      'ru': 'Профиль',
      'mn': 'Профайл',
    },
    'wuo9g50t': {
      'ru': 'Заявки',
      'mn': 'Хэрэглээ',
    },
    'rrlsot6e': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    'mr0mrozz': {
      'ru': 'Отклонить',
      'mn': 'Татгалзах',
    },
    'i101dfie': {
      'ru': 'Подтвердить',
      'mn': 'Баталгаажуулах',
    },
    'gyf704ht': {
      'ru': 'Профиль',
      'mn': 'Профайл',
    },
    'rppvtqu1': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // adminUserCard
  {
    'wjjppuaw': {
      'ru': 'Пользователь',
      'mn': 'Хэрэглэгч',
    },
    '3ffegtg7': {
      'ru': 'Отклонить',
      'mn': 'Татгалзах',
    },
    'jizm2fpm': {
      'ru': 'Подтвердить',
      'mn': 'Баталгаажуулах',
    },
    'l3bt67xx': {
      'ru': 'Пользователь',
      'mn': 'Хэрэглэгч',
    },
    'mg9w33aw': {
      'ru': 'Проверка личности',
      'mn': 'Иргэний үнэмлэх баталгаажуулалт',
    },
    'fjlzcl5x': {
      'ru': 'Фото паспорта',
      'mn': 'Иргэний үнэмлэхний зураг',
    },
    '2bqcx8me': {
      'ru': 'Фото с паспортом',
      'mn': 'Иргэний үнэмлэхтэй зураг',
    },
    'eto2qchz': {
      'ru': 'Решение по проверке',
      'mn': 'Баталгаажуулах шийдвэр',
    },
    'xej7x393': {
      'ru': 'Профиль исполнителя подтвержден',
      'mn': 'Гүйцэтгэгчийн профайл баталгаажсан',
    },
    'qqezoenb': {
      'ru': 'Услуги',
      'mn': 'Үйлчилгээ',
    },
    'uknorw5p': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    'hvte32f6': {
      'ru': '5',
      'mn': '5',
    },
    '4gq8ojoj': {
      'ru': '4',
      'mn': '4',
    },
    'y4omjuax': {
      'ru': '3',
      'mn': '3',
    },
    '9fifs5ze': {
      'ru': '2',
      'mn': '2',
    },
    '8gtxq5da': {
      'ru': '1',
      'mn': '1',
    },
    'disvrz2p': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // adminChats
  {
    'ug243g79': {
      'ru': 'Чаты',
      'mn': 'Чат',
    },
    'pjlr98ea': {
      'ru': 'Мои чаты',
      'mn': 'Миний чатууд',
    },
    '7sh74fzc': {
      'ru': 'Поиск',
      'mn': 'Хайх',
    },
    'fdhzg96x': {
      'ru': 'Документ',
      'mn': 'Бичиг баримт',
    },
    'wrunanlh': {
      'ru': 'Галерея',
      'mn': 'Галерей',
    },
    'tvhre6d1': {
      'ru': '',
      'mn': '',
    },
    'avsgn5j8': {
      'ru': 'Напишите...',
      'mn': 'Бичих...',
    },
    'kwkj2935': {
      'ru': 'Открытые споры',
      'mn': 'Нээлттэй маргаанууд',
    },
    'fmr44d6p': {
      'ru': 'Название',
      'mn': 'Нэр',
    },
    'kvqhvpd9': {
      'ru': 'Подробнее',
      'mn': 'Дэлгэрэнгүй ',
    },
    'li5btp40': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // adminWorkCard
  {
    'bqm4yuub': {
      'ru': 'Заказ',
      'mn': 'Захиалга',
    },
    'dgeux8pa': {
      'ru': 'Приступить к рассмотрению спора',
      'mn': 'Маргаан шийдвэрлэх ажиллагааг эхлүүлэх',
    },
    'ccubrmmf': {
      'ru': 'Перейти в спор',
      'mn': 'Маргаан дээр оч',
    },
    'cy23brj0': {
      'ru': 'Решить спор',
      'mn': 'Маргааныг шийдвэрлэх',
    },
    'hmv2c2nz': {
      'ru': 'Стоимость заказа',
      'mn': 'Захиалгын үнэ',
    },
    'zwwlkb4o': {
      'ru': 'Дата окончания',
      'mn': 'Дуусах огноо',
    },
    'mytgi549': {
      'ru': 'Способ оплаты',
      'mn': 'Төлбөрийн арга',
    },
    '3d7iqt0d': {
      'ru': 'Заказчик',
      'mn': 'Хэрэглэгч',
    },
    '7hx5ystb': {
      'ru': 'Исполнитель',
      'mn': 'Гүйцэтгэгч',
    },
    'vg25ccfz': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // createDebate
  {
    '6xh4482h': {
      'ru': 'Открыть спор',
      'mn': 'Маргаан нээх',
    },
    'o71y4sk0': {
      'ru': 'Обращение',
      'mn': 'Өргөдөл гаргах',
    },
    '74v9fy2b': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'apeb3jqc': {
      'ru': 'Отменить',
      'mn': 'Цуцлах',
    },
    '36caeo49': {
      'ru': 'Отправить',
      'mn': 'Илгээх',
    },
    '6ql5vown': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // webChooseRole
  {
    '8iyz7f06': {
      'ru': 'Выберите роль',
      'mn': 'Өөрийн дүрээ сонгоно уу',
    },
    '1fqwidh0': {
      'ru':
          'Чтобы мы могли предложить Вам подходящие функции, укажите свою роль в приложении',
      'mn':
          'Танд зөв боломжуудыг санал болгоход туслахын тулд аппликешн дэх өөрийн үүргийг зааж өгнө үү.',
    },
    'ox1nkwif': {
      'ru': 'Исполнитель',
      'mn': 'Гүйцэтгэгч',
    },
    'xumtl93h': {
      'ru': 'Ищу заказы для выполнения',
      'mn': 'Гүйцэтгэх захиалга хайж байна',
    },
    'f8am1ss9': {
      'ru': 'Заказчик',
      'mn': 'Хэрэглэгч',
    },
    'wmfubbaf': {
      'ru': 'Ищу исполнителей для заказов',
      'mn': 'Захиалгадаа гүйцэтгэгч хайж байна',
    },
    'zrtttdrf': {
      'ru': 'Применить',
      'mn': 'Ашиглах',
    },
    '91dtpc6h': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // webOrderDetails
  {
    '1a4y42cw': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    'irr0ezkb': {
      'ru': 'Специализация',
      'mn': 'Мэргэшил',
    },
    'sulxzdvo': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'q1m1ggrc': {
      'ru': 'Срок выполнения (дни)',
      'mn': 'Дуусах хугацаа (өдөр)',
    },
    'a4kfel9e': {
      'ru': 'Откликнуться',
      'mn': 'Хариулах',
    },
    '7bb2axqi': {
      'ru': 'Примечание',
      'mn': 'Анхаарна уу',
    },
    'xjc695ku': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // webServiceDetails
  {
    'bkfzlen4': {
      'ru': 'С предложениями',
      'mn': 'Саналтай',
    },
    'bcso8ve2': {
      'ru': 'Стоимость',
      'mn': 'Үнэ',
    },
    'qnqxtrji': {
      'ru': 'Специализация',
      'mn': 'Мэргэшил',
    },
    '5rmlatnp': {
      'ru': 'Локация',
      'mn': 'Байршил',
    },
    'xvh7dtw9': {
      'ru': 'Предложить заказ',
      'mn': 'Захиалга санал болгох',
    },
    'hbi3fygq': {
      'ru': 'Предложения по услуге',
      'mn': 'Үйлчилгээний санал',
    },
    's8iyjvlb': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // webChats
  {
    'u789f9pb': {
      'ru': 'Чаты',
      'mn': 'Чат',
    },
    'lbihuju0': {
      'ru': 'Поиск',
      'mn': 'Хайх',
    },
    'd0v4piov': {
      'ru': 'Документ',
      'mn': 'Бичиг баримт',
    },
    'ldmgxwcn': {
      'ru': 'Галерея',
      'mn': 'Галерей',
    },
    'xgacckci': {
      'ru': '',
      'mn': '',
    },
    'fsv2lb29': {
      'ru': 'Напишите...',
      'mn': 'Бичих...',
    },
    'xvm0nf6l': {
      'ru': 'Нет Чатов',
      'mn': 'Чат байхгүй',
    },
    'yblgzmup': {
      'ru': 'На данный момент у Вас нет чатов',
      'mn': 'Одоогоор танд чат байхгүй байна.',
    },
    'w4yvfn07': {
      'ru': 'Home',
      'mn': 'Нүүр хуудас',
    },
  },
  // botShetChooseRole
  {
    '8piajll2': {
      'ru': 'Выберите роль',
      'mn': 'Өөрийн дүрээ сонгоно уу',
    },
    'o9bomrpt': {
      'ru':
          'Чтобы мы могли предложить Вам подходящие функции, укажите свою роль в приложении',
      'mn':
          'Танд тохирсон боломжуудыг санал болгохын тулд апп дотор өөрийн дүрээ  сонгоно уу.',
    },
    'x33wao77': {
      'ru': 'Исполнитель',
      'mn': 'Гүйцэтгэгч',
    },
    'xacadwfr': {
      'ru': 'Ищу заказы для выполнения',
      'mn': 'Гүйцэтгэх захиалга хайж байна',
    },
    'ja2pwexa': {
      'ru': 'Заказчик',
      'mn': 'Хэрэглэгч',
    },
    '6x0g6ix6': {
      'ru': 'Ищу исполнителей для заказов',
      'mn': 'Захиалгадаа гүйцэтгэгч хайж байна',
    },
    'jskxjr6n': {
      'ru': 'Применить',
      'mn': 'Ашиглах',
    },
  },
  // newCodeSent
  {
    'zpki3k3l': {
      'ru': 'Новый код выслан',
      'mn': 'Шинэ код илгээсэн',
    },
  },
  // modalWindSingUp
  {
    '5pjgs7on': {
      'ru': 'Зарегистрируйтесь!',
      'mn': 'Бүртгүүлэх!',
    },
    'qp3tyurc': {
      'ru':
          'И начните использовать все функции приложения: создавать и находить заказы, откликаться на заказы и зарабатывать',
      'mn':
          'Аппын бүх боломжийг ашиглаж эхлээрэй: захиалга үүсгэх, захиалга хайх, захиалгад хариу өгөх, мөнгө олох.',
    },
    '5z1a3nal': {
      'ru': 'Зарегистрироваться',
      'mn': 'Бүртгүүлэх',
    },
    'bdaewuqk': {
      'ru': 'Может быть позже',
      'mn': 'Магадгүй дараа нь',
    },
  },
  // modalWindWorkerProf
  {
    's71ry55s': {
      'ru': 'Создать профиль исполнителя!',
      'mn': 'Гүйцэтгэгчийн профайл үүсгэх!',
    },
    'calhx2f1': {
      'ru':
          'Хотите откликаться на заказы? Создайте профиль исполнителя в пару кликов',
      'mn':
          'Захиалгад хариу өгөхийг хүсч байна уу? Гүйцэтгэгчийн профайлаа хэдхэн товшилтоор үүсгээрэй.\n',
    },
    'wgwliqry': {
      'ru': 'Создать профиль',
      'mn': 'Профайл үүсгэх',
    },
    'h35ujavf': {
      'ru': 'Может быть позже',
      'mn': 'Магадгүй дараа нь',
    },
  },
  // modalWindCreateOrder
  {
    'doura56q': {
      'ru': 'Создать заказ',
      'mn': 'Захиалга үүсгэх',
    },
    'q9af228u': {
      'ru': 'Хотите найти исполнителя? Создайте заказ прямо сейчас',
      'mn': 'Гүйцэтгэгч хайж байна уу? Захиалгаа яг одоо үүсгээрэй.',
    },
    'lo4q0jjc': {
      'ru': 'Создать заказ',
      'mn': 'Захиалга үүсгэх',
    },
    'p4x50k1j': {
      'ru': 'Может быть позже',
      'mn': 'Магадгүй дараа нь',
    },
  },
  // modalWindAccountSucces
  {
    'rw76a0pc': {
      'ru': 'Аккаунт успешно создан!',
      'mn': 'Бүртгэл амжилттай үүсгэгдсэн!',
    },
    'jc0b6hgv': {
      'ru': 'Поздравляем! Ваш аккаунт создан и готов к использованию',
      'mn': 'Баяр хүргэе! Таны бүртгэл үүсгэгдэж, ашиглахад бэлэн боллоо.',
    },
    'l0jgxa5o': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
  },
  // mainSearch
  {
    'xv6lwrm8': {
      'ru': 'Поиск по названию',
      'mn': 'Нэрээр нь хайх',
    },
  },
  // miniCatFilter
  {
    'dyz3pku1': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'ilibca0x': {
      'ru': 'Option 1',
      'mn': 'Сонголт 1',
    },
    'art6vpnw': {
      'ru': 'Option 2',
      'mn': 'Сонголт 2',
    },
    'g509x6ck': {
      'ru': 'Option 3',
      'mn': 'Сонголт 3',
    },
  },
  // chatFilter
  {
    'q63fyoro': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'xqg5l1i4': {
      'ru': 'Option 1',
      'mn': 'Сонголт 1',
    },
    '1dja3nrn': {
      'ru': 'Option 2',
      'mn': 'Сонголт 2',
    },
    'y4kwvbhw': {
      'ru': 'Option 3',
      'mn': 'Сонголт 3',
    },
  },
  // menu
  {
    '1zpk11ge': {
      'ru': 'Главная',
      'mn': 'Нүүр хуудас',
    },
    '2t8cftnb': {
      'ru': 'Заказы',
      'mn': 'Захиалга',
    },
    'zwrrbbrm': {
      'ru': 'Чаты',
      'mn': 'Чат',
    },
    '17xi299h': {
      'ru': 'Профиль',
      'mn': 'Профайл',
    },
  },
  // emtpyNoNotification
  {
    'x7ygjzw0': {
      'ru': 'Нет уведомлений',
      'mn': 'Мэдэгдэл алга',
    },
    '4wvbu86s': {
      'ru': 'У Вас пока нет уведомлений',
      'mn': 'Танд хараахан мэдэгдэл алга.',
    },
  },
  // notificationCard
  {
    '9olvuwd6': {
      'ru': 'Новое',
      'mn': 'Шинэ',
    },
  },
  // editServiceMenu
  {
    'saonq2nz': {
      'ru': 'Редактировать',
      'mn': 'Засварлах',
    },
    '9xszi6gg': {
      'ru': 'Снять с публикации',
      'mn': 'Нийтлэлээс хасах',
    },
    'vrpyq79r': {
      'ru': 'Опубликовать',
      'mn': 'Нийтлэх',
    },
    'stn9rd3p': {
      'ru': 'Удалить',
      'mn': 'Устгах',
    },
  },
  // responceCard
  {
    '82a2d88h': {
      'ru': 'Отзывы',
      'mn': 'Сэтгэгдэл',
    },
    '1xn2y4h0': {
      'ru': 'Детали',
      'mn': 'Дэлгэрэнгүй мэдээлэл',
    },
  },
  // searchError
  {
    'fght1hzb': {
      'ru': 'Ошибка!',
      'mn': 'Алдаа!',
    },
    'aqi0x9a6': {
      'ru': 'Ошибка поиска, попробуйте позже',
      'mn': 'Хайлтын алдаа, дараа дахин оролдоно уу',
    },
    'f3w0dgbp': {
      'ru': 'Пропустить',
      'mn': 'Алгасах',
    },
  },
  // logOut
  {
    '2ouj4cxr': {
      'ru': 'Выйти из аккаунта',
      'mn': 'Гарах',
    },
    '085v3fea': {
      'ru': 'Вы уверены, что хотите выйти?',
      'mn': 'Та гарахдаа итгэлтэй байна уу?',
    },
    '0g7l5lj8': {
      'ru': 'Отмена',
      'mn': 'Цуцлах',
    },
    'i04pv27p': {
      'ru': 'Да, выйти',
      'mn': 'Тийм ээ, гар',
    },
  },
  // logOutAnim
  {
    '6k5ablgi': {
      'ru': 'Выход из аккаунта',
      'mn': 'Аккаунтас  гарах',
    },
  },
  // deleteAccountAnim
  {
    '245aka6k': {
      'ru': 'Удаление аккаунта',
      'mn': 'Бүртгэл устгаж байна',
    },
  },
  // deleteAccount
  {
    'zu2dc3uy': {
      'ru': 'Удалить аккаунт?',
      'mn': 'Бүртгэлийг устгах уу?',
    },
    '7w1mznxw': {
      'ru': 'Вы уверены, что хотите удалить аккаунт?',
      'mn': 'Та бүртгэлээ устгахдаа итгэлтэй байна уу?',
    },
    'flq8oy0u': {
      'ru': 'Да, удалить',
      'mn': 'Тийм ээ, устга',
    },
    'jaick682': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
  },
  // modalWindCreateReview
  {
    'jhktwj5v': {
      'ru': 'Спасибо за Вашу оценку!',
      'mn': 'Үнэлгээ өгсөнд баярлалаа!',
    },
    'fm5d2yfb': {
      'ru': 'Мы ценим Ваше время  и надеемся улучшить  наш сервис...',
      'mn':
          'Бид таны цагийг үнэлж, үйлчилгээгээ сайжруулна гэдэгт найдаж байна...',
    },
  },
  // modalWindCreateServiceSuccsess
  {
    'rpnbocgg': {
      'ru': 'Услуга успешно создана',
      'mn': 'Үйлчилгээг амжилттай үүсгэсэн.',
    },
    'vs0g7nfq': {
      'ru': 'Услуга ',
      'mn': 'Үйлчилгээ',
    },
    '7ovq8ykn': {
      'ru': ' создана и доступна для заказчиков',
      'mn':
          'Таны үйлчилгээ амжилттай үүсгэгдэж, захиалагчдад ашиглах боломжтой боллоо.',
    },
    'u4ixzd1u': {
      'ru': 'К услуге',
      'mn': 'Үйлчилгээний хувьд',
    },
    '3vc17qj2': {
      'ru': 'На главную',
      'mn': 'Үндсэн хуудас руу',
    },
  },
  // modalWindVerificationSuccess
  {
    'e6lnek65': {
      'ru':
          'Теперь вы можете откликаться на заказы и получать новые возможности',
      'mn': 'Одоо та захиалгад хариу өгч, шинэ боломжуудыг авах боломжтой',
    },
    'j19q0l61': {
      'ru': 'Поздравляем! Ваш аккаунт создан и готов к использованию',
      'mn': 'Баяр хүргэе! Таны бүртгэл үүсгэгдэж, ашиглахад бэлэн боллоо.',
    },
    'vt48x9ro': {
      'ru': 'Перейти к заказам',
      'mn': 'Захиалга руу оч',
    },
  },
  // modalWindVerificationProcessed
  {
    'l7hw43kn': {
      'ru': 'Профиль на проверке',
      'mn': 'Профайлыг хянаж байна',
    },
    'pr2uznb9': {
      'ru':
          'Ваш профиль отправлен  на модерацию. Обычно это занимает до 24 часов. Мы уведомим вас, когда профиль будет одобрен',
      'mn':
          'Таны профайл модерацид илгээгдлээ. Ихэвчлэн энэ нь 24 цагийн дотор дуусдаг. Профайл батлагдмагц бид танд мэдэгдэнэ.',
    },
    'nyklj6gw': {
      'ru': 'Вернуться на главную',
      'mn': 'Нүүр хуудас руу буцах',
    },
  },
  // modalWindVerificationFAILED
  {
    '8s0o5i2w': {
      'ru': 'Ваш профиль исполнителя отклонён',
      'mn':
          'Таны гүйцэтгэгчийн профайл татгалзагдлаа. Өгөгдлөө шалгаад дахин оролдоно уу.',
    },
    'vnetgk4i': {
      'ru': 'Исправить профиль',
      'mn': 'профайл засварлах',
    },
    'lxlxw73d': {
      'ru': 'Отмена',
      'mn': 'Цуцлах',
    },
  },
  // modalWindVerificationTERMINATED
  {
    'i5q93sdo': {
      'ru': 'Отменить верификацию?',
      'mn': 'Баталгаажуулалтыг цуцлах уу?',
    },
    'i1895fg0': {
      'ru':
          'Все введенные вами ранее данные удаляться и Вам придется начать сначала',
      'mn':
          'Таны өмнө оруулсан бүх өгөгдөл устах бөгөөд та дахин эхлүүлэх хэрэгтэй болно.',
    },
    'u3yn02z3': {
      'ru': 'Да, отменить',
      'mn': 'Тийм ээ, цуцлах',
    },
    '8mptgyg6': {
      'ru': 'Отмена',
      'mn': 'Цуцлах',
    },
  },
  // deleteService
  {
    '325b3y7z': {
      'ru': 'Удалить услугу?',
      'mn': 'Үйлчилгээг устгах уу?',
    },
    'm6bim2qp': {
      'ru': 'Вы уверены, что хотите удалить услугу?',
      'mn': 'Та үйлчилгээг устгахдаа итгэлтэй байна уу?',
    },
    '3x0vgs40': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
    '6g34agpg': {
      'ru': 'Да, удалить',
      'mn': 'Тийм ээ, устга',
    },
  },
  // deleteServInfo
  {
    'smreaznl': {
      'ru': 'Удаление услуги',
      'mn': 'Үйлчилгээг устгаж байна',
    },
  },
  // hideService
  {
    '59jj5at2': {
      'ru': 'Снять с публикации',
      'mn': 'Нийтлэлээс хасах',
    },
    '4m0jni61': {
      'ru':
          'Услуга будет снята с публикации и не будет отображаться в ленте заказчиков',
      'mn':
          'Үйлчилгээг нийтлэхээс хасах бөгөөд хэрэглэгчийн мэдээллийн санд харагдахгүй.',
    },
    'm8cp56o0': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
    'vtckqkh0': {
      'ru': 'Да, снять',
      'mn': 'Тийм ээ, тайл',
    },
  },
  // hideServInfo
  {
    '90o1qkqw': {
      'ru': 'Услуга снята с публикации',
      'mn': 'Үйлчилгээг хэвлэлээс хассан.',
    },
  },
  // ShowService
  {
    'mf85qukq': {
      'ru': 'Опубликовать',
      'mn': 'Нийтлэх',
    },
    '5iluz3np': {
      'ru': 'Услуга будет опубликована и будет отображаться в ленте заказчиков',
      'mn': 'Үйлчилгээг нийтэлж, хэрэглэгчдийн мэдээллийн санд харуулах болно',
    },
    'r6x00dqs': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
    'jzghrpt3': {
      'ru': 'Опубликовать',
      'mn': 'Нийтлэх',
    },
  },
  // showServInfo
  {
    '1gx3grr3': {
      'ru': 'Услуга опубликована',
      'mn': 'Үйлчилгээ нийтлэгдсэн байна',
    },
  },
  // emtpyReviews
  {
    '9xe4asbh': {
      'ru': 'Пока нет отзывов',
      'mn': 'Одоогоор сэтгэгдэл алга',
    },
  },
  // emtpyDoneWorks
  {
    'emncfcg1': {
      'ru': 'Завершённых заказов нет',
      'mn': 'Дууссан захиалга байхгүй байна.',
    },
  },
  // emtpyNewWorks
  {
    '9e9nu0yj': {
      'ru': 'Активных заказов нет',
      'mn': 'Идэвхтэй захиалга алга.',
    },
  },
  // safeFactDeal
  {
    'g7l3z7uz': {
      'ru': 'Безопасная сделка',
      'mn': 'Аюулгүй хэлцэл',
    },
    'g9q2h1y0': {
      'ru': 'По факту выполнения заказа',
      'mn': 'Захиалга дууссаны дараа',
    },
  },
  // infoSafeDeal
  {
    'pqtnxkhx': {
      'ru': 'Безопасная сделка',
      'mn': 'Аюулгүй хэлцэл',
    },
    '7ihkdgr6': {
      'ru': 'Мөнгийг гаргах үед сервисийн шимтгэл суутгагдана.',
      'mn': 'Үйлчилгээний хураамж авна.',
    },
    'kblbhn97': {
      'ru':
          'Средства за выполнение заказа будут захолдированы на счёте приложения и будут переведены исполнителю только в случае подтверждения выполнения заказа',
      'mn':
          'Захиалга бөглөхөд шаардагдах хөрөнгийг өргөдлийн дансанд байршуулах бөгөөд захиалга баталгаажсан тохиолдолд л гүйцэтгэгчид шилжүүлнэ.',
    },
    'od570q1i': {
      'ru': 'Ок',
      'mn': 'OK',
    },
  },
  // infoFactDeal
  {
    'z72q98bv': {
      'ru': 'По факту выполнения заказа',
      'mn': 'Захиалга дууссаны дараа',
    },
    'pg32l35e': {
      'ru': 'Оплата производится напрямую исполнителю',
      'mn': 'Төлбөр шууд гүйцэтгэгчид хийгдэнэ',
    },
    '0dy3pkro': {
      'ru': 'Ок',
      'mn': 'OK',
    },
  },
  // emtpyNoChats
  {
    'nwymxa9y': {
      'ru': 'Нет чатов',
      'mn': 'Чат байхгүй',
    },
    '74r0wa7o': {
      'ru': 'На данный момент у Вас нет чатов',
      'mn': 'Одоогоор танд чат байхгүй байна.',
    },
  },
  // editOrderMenu
  {
    'e91sjqtg': {
      'ru': 'Редактировать',
      'mn': 'Засварлах',
    },
    'i6c55q90': {
      'ru': 'Снять с публикации',
      'mn': 'Нийтлэлээс хасах',
    },
    '7d0ke6a1': {
      'ru': 'Опубликовать',
      'mn': 'Нийтлэх',
    },
    'y2yh3u3l': {
      'ru': 'Удалить',
      'mn': 'Устгах',
    },
  },
  // deleteOrder
  {
    'v0mbcgse': {
      'ru': 'Удалить заказ?',
      'mn': 'Захиалга устгах уу?',
    },
    'lttli2ny': {
      'ru': 'Вы уверены, что хотите удалить заказ?',
      'mn': 'Та захиалгыг устгахдаа итгэлтэй байна уу?',
    },
    'ipr9003x': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
    '5sam8039': {
      'ru': 'Да, удалить',
      'mn': 'Тийм ээ, устга',
    },
  },
  // deleteOrderInfo
  {
    'zo882l2r': {
      'ru': 'Удаление заказа',
      'mn': 'Захиалгыг устгаж байна',
    },
  },
  // hideOrder
  {
    'buqlxak7': {
      'ru': 'Снять с публикации',
      'mn': 'Нийтлэлээс хасах',
    },
    'pje92vph': {
      'ru':
          'Заказ будет снят с публикации и не будет отображаться в ленте исполнителей',
      'mn':
          'Захиалгыг нийтлэхээс хасах бөгөөд жүжигчдийн хангамжид харуулахгүй.',
    },
    'brfcabdw': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
    'inh1c30x': {
      'ru': 'Да, снять',
      'mn': 'Тийм ээ, тайл',
    },
  },
  // hideOrderInfo
  {
    'tvd3ne3u': {
      'ru': 'Заказ снят с публикации',
      'mn': 'Захиалга нийтлэлээс хасагдсан',
    },
  },
  // ShowOrder
  {
    'v81d5q2a': {
      'ru': 'Опубликовать',
      'mn': 'Нийтлэх',
    },
    'mi17vj1r': {
      'ru': 'Заказ будет опубликован и будет отображаться в ленте исполнителей',
      'mn': 'Захиалга нийтлэгдэж, гүйцэтгэгчдийн фийд дээр харагдана.',
    },
    'aqqwyg3x': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
    '429bzxm1': {
      'ru': 'Опубликовать',
      'mn': 'Нийтлэх',
    },
  },
  // showOrderInfo
  {
    '7hrdwbu7': {
      'ru': 'Заказ опубликован',
      'mn': 'Захиалга нийтлэгдсэн',
    },
  },
  // modalWindGetOrder
  {
    'byz4fmbw': {
      'ru': 'Откликнуться',
      'mn': 'Хариулах',
    },
    'bp4zsbs5': {
      'ru': 'Откликнуться',
      'mn': 'Хариулах',
    },
    'i17vc0b3': {
      'ru': 'Отмена',
      'mn': 'Цуцлах',
    },
  },
  // modalWindVerificWOrker
  {
    'ram68n3j': {
      'ru': 'Отклик временно недоступен',
      'mn': 'Хариултыг түр хугацаагаар авах боломжгүй',
    },
    'hfo8iwg1': {
      'ru':
          'Ваш профиль исполнителя находится на проверке. После завершения модерации Вы сможете откликаться на заказы',
      'mn':
          'Таны жүжигчний профайлыг шалгаж байна. Зохицуулалт дууссаны дараа та захиалгад хариу өгөх боломжтой болно',
    },
    'n072obf4': {
      'ru': 'Перейти в профиль',
      'mn': 'Профайл руу оч',
    },
    'q8b7fize': {
      'ru': 'На главную',
      'mn': 'Үндсэн хуудас руу',
    },
  },
  // modalWindNotMoney
  {
    'qiggvzou': {
      'ru': 'Пополнить баланс!',
      'mn': 'Үлдэгдэл цэнэглэх',
    },
    '3sszlra6': {
      'ru': 'Пополнить баланс',
      'mn': 'Үлдэгдэл цэнэглэх',
    },
    'br5x9llo': {
      'ru': 'Отмена',
      'mn': 'Цуцлах',
    },
  },
  // modalWindGetOrderSucces
  {
    '34d7wgwd': {
      'ru': 'Отклик отправлен!',
      'mn': 'Хариу илгээсэн!',
    },
    'in591rv7': {
      'ru':
          'Вы успешно отправили отклик на данный заказ. Статус заказа Вы можете увидеть в разделе «Активные заказы».',
      'mn':
          'Таны хариу амжилттай илгээгдлээ. Захиалгын явцыг «Идэвхтэй захиалгууд» хэсгээс шалгана уу.',
    },
    '5qmbtqk0': {
      'ru': 'К активным заказам',
      'mn': 'Идэвхтэй захиалгууд руу',
    },
    '88cdho19': {
      'ru': 'На главную',
      'mn': 'Үндсэн хуудас руу',
    },
  },
  // transactionCorrect
  {
    'ylutjtsj': {
      'ru': 'Транзакция завершена',
      'mn': 'Гүйлгээ дууссан',
    },
    'wplsrjvz': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
  },
  // incomeInfo
  {
    '9qmlx4v1': {
      'ru': 'Ожидается пополнение',
      'mn': 'Шинэ нэмэлтүүд хүлээж байна',
    },
  },
  // outcomeInfo
  {
    'owxhzzph': {
      'ru': 'Ожидается вывод',
      'mn': 'Гаргалт хүлээгдэж байна',
    },
  },
  // outcomeIncorrect
  {
    '538r3g4z': {
      'ru': 'ОШИБКА!\nНедостаточно средств',
      'mn': 'ERROR!\nСанхүүжилт хангалтгүй',
    },
    'wetxjbe0': {
      'ru': 'Ок',
      'mn': 'OK',
    },
  },
  // modalWindOfferOrderSucces
  {
    'nxfweshf': {
      'ru': 'Предложение  отправлено!',
      'mn': 'Санал илгээсэн!',
    },
    '198q1uhp': {
      'ru':
          'Вы успешно отправили предложение на данный заказ. Исполнитель сможет откликнуться на него со статусом “по предложению”',
      'mn':
          'Та энэ захиалгад амжилттай санал илгээлээ. Гүйцэтгэгч уг захиалгад “саналаар” гэсэн статустайгаар хариу өгч чадна.',
    },
    'vaizg28e': {
      'ru': 'Ок',
      'mn': 'OK',
    },
  },
  // modalWindCreateOrderSuccsess
  {
    'w61gi0kw': {
      'ru': 'Заказ создан успешно!',
      'mn': 'Захиалга амжилттай үүсгэгдсэн!',
    },
    'joshmyds': {
      'ru': 'Заказ ',
      'mn': 'Захиалга',
    },
    'p2c08dmz': {
      'ru': ' создан и доступен для исполнителей',
      'mn':
          'Таны захиалга амжилттай үүсгэгдэж, гүйцэтгэгчдэд харагдах боломжтой боллоо.',
    },
    'mmmwz55q': {
      'ru': 'К заказу',
      'mn': 'Захиалга өгөх',
    },
    'u4clr92l': {
      'ru': 'На главную',
      'mn': 'Үндсэн хуудас руу',
    },
  },
  // modalWindApprovedWorker
  {
    'a0zzzf1r': {
      'ru': 'Исполнитель подтверждён!',
      'mn': 'Гүйцэтгэгч батлагдлаа!',
    },
    '2r9e1vj6': {
      'ru': 'К заказу',
      'mn': 'Захиалга өгөх',
    },
  },
  // modalWindDeniedWorker
  {
    'deu2eu4g': {
      'ru': 'Исполнитель отклонен!',
      'mn': 'Гүйцэтгэгч татгалзсан!',
    },
    'xhd4mp1p': {
      'ru': 'Ок',
      'mn': 'OK',
    },
  },
  // modalWindCompleteWrk
  {
    'mws8encx': {
      'ru': 'Запросить завершение',
      'mn': 'Хүсэлт бөглөх',
    },
    'st51hun4': {
      'ru':
          'Вы выполнили все условия заказа? Ваш запрос будет отправлен заказчику  для подтверждения. Если заказчик не отреагирует  в течение 14 дней, деньги  за заказ будут автоматически переведены Вам',
      'mn':
          'Вы выполнили все условия заказа? Ваш запрос будет отправлен заказчику для подтверждения. Если заказчик не отреагирует в течение 14 дней, деньги за заказ будут автоматически переведены Вам →',
    },
    '5zshmb82': {
      'ru': 'Отправить запрос',
      'mn': 'Хүсэлт илгээх',
    },
    'sqq92dak': {
      'ru': 'Отмена',
      'mn': 'Цуцлах',
    },
  },
  // completeWorkInfo
  {
    'tgkt74vy': {
      'ru': 'Заказ завершен',
      'mn': 'Захиалга дууссан',
    },
  },
  // modalWindDoneWork
  {
    'hla2fk0c': {
      'ru': 'Подтвердить завершение?',
      'mn': 'Та дууссаныг батлахдаа итгэлтэй байна уу?',
    },
    '9ne8b6a3': {
      'ru': 'Деньги за заказ будут перечислены исполнителю',
      'mn': 'Захиалгын мөнгийг гүйцэтгэгчид шилжүүлнэ.',
    },
    'dhd7y5q4': {
      'ru': 'Подтвердить',
      'mn': 'Баталгаажуулах',
    },
    'zo2ca590': {
      'ru': 'Отмена',
      'mn': 'Цуцлах',
    },
  },
  // doneWorkInfo
  {
    'r1a3o7af': {
      'ru': 'Запрос выслан',
      'mn': 'Хүсэлт илгээсэн',
    },
  },
  // emtpySearch
  {
    'y66nsm30': {
      'ru': 'Ничего не найдено',
      'mn': 'Юу ч олдсонгүй',
    },
  },
  // adminForgotPass
  {
    '08uj7yqw': {
      'ru': 'Забыли пароль?',
      'mn': 'Нууц үгээ мартсан уу?',
    },
    'yg5m5mi2': {
      'ru': 'Введите адрес электронной почты, чтобы восстановить пароль',
      'mn': 'Нууц үгээ сэргээхийн тулд имэйл хаягаа оруулна уу',
    },
    '3hua1915': {
      'ru': 'Email',
      'mn': 'Имэйл',
    },
    'uwqyies4': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '3yah5dbf': {
      'ru': 'Отправить',
      'mn': 'Илгээх',
    },
  },
  // adminChaeckName
  {
    '0q9gw9y8': {
      'ru': 'Проверка данных',
      'mn': 'Өгөгдлийн баталгаажуулалт',
    },
    'kkgmeol6': {
      'ru': 'Введите имя, чтобы отправить данные на проверку для подтверждения',
      'mn':
          'Баталгаажуулахын тулд дэлгэрэнгүй мэдээллээ оруулахын тулд нэрээ оруулна уу.',
    },
    'jsczu8dc': {
      'ru': 'Имя',
      'mn': 'Нэр',
    },
    'g0nkmngn': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'pm9oa7s5': {
      'ru': 'Отправить',
      'mn': 'Илгээх',
    },
  },
  // adminChaeckNameCheck
  {
    '2xha47io': {
      'ru': 'Данные на проверке',
      'mn': 'Мэдээлэл баталгаажуулалтад байна',
    },
    'i8f46s5g': {
      'ru': 'c',
      'mn': 'Захиргааны шийдвэрийг хүлээнэ үү',
    },
  },
  // adminChaeckNameDenied
  {
    'do0fvltd': {
      'ru': 'Ваш профиль не подтвержден',
      'mn': 'Таны профайлыг баталгаажуулаагүй байна',
    },
    't77cg09f': {
      'ru': 'Попробуйте зарегистрироваться ещё раз!',
      'mn': 'Дахин бүртгүүлж үзнэ үү!',
    },
    'ip6bqz6l': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
  },
  // adminChaeckNameComplet
  {
    'bp04clkn': {
      'ru': 'Ваш профиль подтвержден',
      'mn': 'Таны профайлыг баталгаажууллаа.',
    },
    'ckjdt47u': {
      'ru': 'Начните работу',
      'mn': 'Ажил эхлүүлэх',
    },
    'cxpkeow3': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
  },
  // adminMenu
  {
    '39uyb298': {
      'ru': 'УПРАВЛЕНИЕ',
      'mn': 'Удирдлага',
    },
    '2e2hwbcy': {
      'ru': 'Профиль',
      'mn': 'Профайл',
    },
    '7wawnand': {
      'ru': 'Сотрудники',
      'mn': 'Ажилчид',
    },
    're9yc9oc': {
      'ru': 'КОНТЕНТ',
      'mn': 'АГУУЛГА',
    },
    'a8tvxx02': {
      'ru': 'Категории',
      'mn': 'Ангилал',
    },
    '3iz3kwk7': {
      'ru': 'ПОДДЕРЖКА',
      'mn': 'Тусламж',
    },
    '9ckfpupn': {
      'ru': 'Пользователи',
      'mn': 'Хэрэглэгчид',
    },
    'tbhyii0o': {
      'ru': 'Чаты',
      'mn': 'Чат',
    },
  },
  // adminLogout
  {
    'l7aeleym': {
      'ru': 'Выйти из аккаунта?',
      'mn': 'Аккаунтаасаа  гарах уу?',
    },
    'aw3q1j4j': {
      'ru': 'Вы уверены,что хотите выйти?',
      'mn': 'Та гарахдаа итгэлтэй байна уу?',
    },
    'hswalixu': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
    'd7ypb1ju': {
      'ru': 'Да, выйти',
      'mn': 'Тийм ээ, гар',
    },
  },
  // adminLogoutInfo
  {
    '7lgx85e3': {
      'ru': 'Вы вышли из аккаунта',
      'mn': 'Та аккаунтаасаа гарсан байна',
    },
  },
  // adminDelAccInfo
  {
    'd5ilfrd3': {
      'ru': 'Аккаунт удалён',
      'mn': 'Бүртгэлийг устгасан',
    },
  },
  // adminDelAcc
  {
    'fqpwc34d': {
      'ru': 'Удалить аккаунт?',
      'mn': 'Бүртгэлийг устгах уу?',
    },
    'fma88ita': {
      'ru': 'Вы уверены, что хотите удалить аккаунт?',
      'mn': 'Та бүртгэлээ устгахдаа итгэлтэй байна уу?',
    },
    'y5j53n7m': {
      'ru': 'Да, удалить',
      'mn': 'Тийм ээ, устга',
    },
    'yn6ade8a': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
  },
  // adminEmploeeMenu
  {
    'xvvpim6q': {
      'ru': 'Редактировать',
      'mn': 'Засварлах',
    },
    '1472avyn': {
      'ru': 'Разблокировать',
      'mn': 'Блокыг тайлах',
    },
  },
  // adminEditEmployee
  {
    'jpyipacm': {
      'ru': 'Роль сотрудника',
      'mn': 'Ажилтны үүрэг',
    },
    '23yv9g35': {
      'ru': 'Роль сотрудника',
      'mn': 'Ажилтны үүрэг',
    },
    'zgasr2dt': {
      'ru': '',
      'mn': '',
    },
    'b227q761': {
      'ru': 'Выберите роль',
      'mn': 'Дүр сонгох',
    },
    'oxq5r2eq': {
      'ru': 'Search...',
      'mn': 'Хайх...',
    },
    'kerha7w0': {
      'ru': 'Сотрудник',
      'mn': 'Ажилтан',
    },
    'nmjk34d9': {
      'ru': 'Администратор',
      'mn': 'Админ',
    },
    '123u46l1': {
      'ru': 'Задачи',
      'mn': 'Даалгаврууд',
    },
    'w3cjyz2u': {
      'ru': '',
      'mn': '',
    },
    'r6d8ic5v': {
      'ru': 'Выберите задачи',
      'mn': 'Даалгавруудыг сонгох',
    },
    'o6b96dlh': {
      'ru': 'Search...',
      'mn': 'Хайх...',
    },
    '9na6jsjy': {
      'ru': 'Все',
      'mn': 'Бүгд',
    },
    'z2zho91k': {
      'ru': 'Споры',
      'mn': 'Маргаан',
    },
    'gs5e7s9b': {
      'ru': 'Категории',
      'mn': 'Ангилал',
    },
    'z3fdoyi3': {
      'ru': 'Применить',
      'mn': 'Өргөдөл гаргах',
    },
  },
  // adminEmployeeDenied
  {
    'e17tj6mp': {
      'ru': 'Отклонить регистрацию сотрудника?',
      'mn': 'Ажилтны бүртгэлээс татгалзах уу?',
    },
    'ks9o2vke': {
      'ru': 'Да, отклонить',
      'mn': 'Тийм ээ, татгалз',
    },
    'kemaxz6s': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
  },
  // adminEmployeeDeniedInfo
  {
    'ooxpzy32': {
      'ru': 'Регистрация отклонена',
      'mn': 'Бүртгэлээс татгалзсан',
    },
    'n23i6423': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
  },
  // adminCategoryMenu
  {
    'stb03ndz': {
      'ru': 'Опубликовать',
      'mn': 'Нийтлэх',
    },
    'i3jirogb': {
      'ru': 'Редактировать',
      'mn': 'Засварлах',
    },
    'm5nbru0r': {
      'ru': 'Удалить',
      'mn': 'Устгах',
    },
  },
  // adminDelCat
  {
    '8vsiv31c': {
      'ru': 'Удалить категорию?',
      'mn': 'Ангилал устгах уу?',
    },
    '87fpmhxw': {
      'ru': 'Категория будет удалена из приложения',
      'mn': 'Ангилал нь програмаас хасагдах болно.',
    },
    've7ybt37': {
      'ru': 'Да, удалить',
      'mn': 'Тийм ээ, устга',
    },
    'ebthzcut': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
  },
  // adminDelCatInfo
  {
    'f0w1xlvi': {
      'ru': 'Категория удалена',
      'mn': 'Ангилал хасагдсан',
    },
  },
  // adminShowCat
  {
    'dtv786l9': {
      'ru': 'Опубликовать категорию?',
      'mn': 'Ангилал нийтлэх үү?',
    },
    'da71hvyb': {
      'ru':
          'ВНИМАНИЕ! Псоле публикации категории, редактирование будет невозможно!',
      'mn': 'АНХААР! Ангилал нийтэлсний дараа засварлах боломжгүй болно!',
    },
    'my8zf356': {
      'ru': 'Да, опубликовать',
      'mn': 'Тийм ээ, нийтлэх',
    },
    'lohaa5l3': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
  },
  // adminShowCatInfo
  {
    'cosphs70': {
      'ru': 'Категория опубликована',
      'mn': 'Ангилал нийтлэгдсэн',
    },
  },
  // adminEditCat
  {
    'fd8a9n31': {
      'ru': 'Проверка данных',
      'mn': 'Өгөгдлийн баталгаажуулалт',
    },
    '3zwzhvke': {
      'ru': 'Название',
      'mn': 'Нэр',
    },
    'fazdq16u': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '1mjr9s1e': {
      'ru': 'Сохранить',
      'mn': 'Хадгалах',
    },
  },
  // adminCreateCat
  {
    '4h5j0200': {
      'ru': 'Создать категорию',
      'mn': 'Ангилал үүсгэх',
    },
    'csfxushu': {
      'ru': 'Название',
      'mn': 'Нэр',
    },
    'pkss37dq': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'k37o2xk4': {
      'ru': 'Сохранить',
      'mn': 'Хадгалах',
    },
    'qigzu9db': {
      'ru': 'Опубликовать',
      'mn': 'Нийтлэх',
    },
  },
  // adminUserKYCDenied
  {
    'gd4nrwhc': {
      'ru': 'Отклонить регистрацию пользователя',
      'mn': 'Хэрэглэгчийн бүртгэлээс татгалзах',
    },
    '7q04pnhe': {
      'ru': 'Причина',
      'mn': 'Шалтгаан',
    },
    '8rwg9rv3': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '81a4c82z': {
      'ru': 'Да, отклонить',
      'mn': 'Тийм ээ, татгалз',
    },
    'sj067ans': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
  },
  // adminUserKYCdeniedInfo
  {
    'avg5f69s': {
      'ru': 'Регистрация отклонена',
      'mn': 'Таны бүртгэл татгалзагдсан',
    },
  },
  // adminUserKYCcomplete
  {
    'fzjsau9u': {
      'ru': 'Подтвердить регистрацию пользователя?',
      'mn': 'Хэрэглэгчийн бүртгэлийг баталгаажуулах уу?',
    },
    'ek4pmq4d': {
      'ru': 'Нет',
      'mn': 'Үгүй',
    },
    'nfwphflt': {
      'ru': 'Подтвердить',
      'mn': 'Баталгаажуулах',
    },
  },
  // adminUserKYCcompleteInfo
  {
    'tsixr5nl': {
      'ru': 'Регистрация подтверждена',
      'mn': 'Бүртгэл баталгаажлаа',
    },
    '9t71786f': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
  },
  // adminCompleteDebate
  {
    'crjvqvco': {
      'ru': 'Решить спор',
      'mn': 'Маргааныг шийдвэрлэх',
    },
    'ka5bzx4i': {
      'ru': 'Сумма по заказу (',
      'mn': 'Захиалгын дүн (',
    },
    'lh09x2t8': {
      'ru': ') будет перечислена лицу, в чью пользу был решён спор',
      'mn': ') маргааныг түүний талд шийдвэрлэсэн этгээдэд шилжүүлнэ',
    },
    'vjsyt8x5': {
      'ru': 'Исполнитель',
      'mn': 'Гүйцэтгэгч',
    },
    '4joxkxzp': {
      'ru': 'Заказчик',
      'mn': 'Хэрэглэгч',
    },
    'ulzv1jjx': {
      'ru': 'Разделить сумму',
      'mn': 'Нийлбэрийг хуваа',
    },
    'vea39vdi': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
  },
  // adminCompleteDebateSeparate
  {
    '95sbgr7m': {
      'ru': 'Разделить сумму',
      'mn': 'Нийлбэрийг хуваа',
    },
    '0r8l6zoq': {
      'ru': 'Сумма по заказу (',
      'mn': 'Захиалгын дүн (',
    },
    'b1zp5emg': {
      'ru': ') будет перечислена лицу, в чью пользу был решён спор',
      'mn': ') маргааныг түүний талд шийдвэрлэсэн этгээдэд шилжүүлнэ',
    },
    'tpnl5ekd': {
      'ru': 'Сумма исполнителю',
      'mn': 'Гүйцэтгэгчид олгох дүн',
    },
    'tyvhqo02': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '3du6t0bc': {
      'ru': 'Сумма заказчику',
      'mn': 'Сумма заказчику',
    },
    'v5maechf': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'dk1f8msg': {
      'ru': 'Назад',
      'mn': 'Буцах',
    },
    '0pi67gli': {
      'ru': 'Применить',
      'mn': 'Хэрэгжүүлэх',
    },
  },
  // adminDebateClose
  {
    'rhln9hfv': {
      'ru': 'Спор закрыт',
      'mn': 'Маргаан хаалттай байна',
    },
    'mdvo18s7': {
      'ru': 'Спор закрыт: в пользу',
      'mn': 'Маргаан хаалттай байна: дэмжсэн',
    },
    'e3pcujgt': {
      'ru': 'исполниетеля',
      'mn': 'Гүйцэтгэгч',
    },
    'kwunnj77': {
      'ru': 'заказчика',
      'mn': 'үйлчлүүлэгч',
    },
    '666iswdq': {
      'ru': 'исполнителя /',
      'mn': 'Гүйцэтгэгч /',
    },
    'x9sibwk7': {
      'ru': 'заказчика',
      'mn': 'үйлчлүүлэгч',
    },
    'ppn036jm': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
  },
  // adminIncorrectSeparate
  {
    '5hbktl3y': {
      'ru': 'ОШИБКА!\nПроверьте корректность сумм',
      'mn': 'ERROR!\nДүнгийн зөв эсэхийг шалгана уу',
    },
    'bfm7dsol': {
      'ru': 'Ок',
      'mn': 'OK',
    },
  },
  // modalWindDebateOpen
  {
    'kq6dipfk': {
      'ru': 'Спор открыт!',
      'mn': 'Маргаан нээлттэй байна!',
    },
    '2tah2oez': {
      'ru':
          'Мы передали информацию заказчику и нашему специалисту службы поддержки. В ближайшее время с Вами свяжется сотрудник  для уточнения деталей',
      'mn':
          'Бид мэдээллийг захиалагчид болон манай хэрэглэгчийн дэмжлэгийн мэргэжилтэнд дамжууллаа. Ойрын хугацаанд танд дэлгэрэнгүй мэдээлэл тодруулахын тулд манай ажилтан холбогдох болно.',
    },
    's2kstrxx': {
      'ru': 'К заказу',
      'mn': 'Захиалга руу',
    },
  },
  // debateMenu
  {
    'fiyz9taw': {
      'ru': 'Открыть спор',
      'mn': 'Маргаан нээх',
    },
  },
  // webMenu
  {
    'ci8hcuoq': {
      'ru': 'Главная',
      'mn': 'Нүүр хуудас',
    },
    'vib86535': {
      'ru': 'Активные заказы',
      'mn': 'Идэвхтэй захиалга',
    },
    'zgtesi3b': {
      'ru': 'Чаты',
      'mn': 'Чат',
    },
    '60jxodpj': {
      'ru': 'Мои услуги',
      'mn': 'Миний үйлчилгээ',
    },
    'ezvhy9u9': {
      'ru': 'Мои заказы',
      'mn': 'Миний захиалга',
    },
  },
  // webCategory
  {
    '2t1zkaxf': {
      'ru': 'Сбросить',
      'mn': 'Дахин тохируулах',
    },
    '1wcvh0iq': {
      'ru': 'Применить',
      'mn': 'Өргөдөл гаргах',
    },
  },
  // webPrice
  {
    'nc29ey4h': {
      'ru': 'От',
      'mn': '-аас',
    },
    '70excpmb': {
      'ru': 'До',
      'mn': 'руу',
    },
    '3tmuhmqj': {
      'ru': 'Сбросить',
      'mn': 'Дахин тохируулах',
    },
    'ubuvi8mi': {
      'ru': 'Применить',
      'mn': 'Өргөдөл гаргах',
    },
  },
  // webLocation
  {
    'k2gi67d8': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'lu7129uc': {
      'ru': 'Option 1',
      'mn': 'Сонголт 1',
    },
    'd68r9pq2': {
      'ru': 'Радиус от текущего местоположения',
      'mn': 'Одоогийн байршлаас ',
    },
    '8v54y14p': {
      'ru': 'Предоставить доступ к геолокации',
      'mn': 'Гео байршлын эрхийг олгох',
    },
    'a9m25r4l': {
      'ru': 'Перейти',
      'mn': 'руу оч',
    },
    'y1onytej': {
      'ru': 'Доступ к геолокации получен',
      'mn': 'Гео байршлын зөвшөөрөл олгогдлоо',
    },
    'alehufrm': {
      'ru': 'Обновить',
      'mn': 'Сэргээх',
    },
    'a2a5bh7t': {
      'ru': 'Сбросить',
      'mn': 'Дахин тохируулах',
    },
    'tybhmadx': {
      'ru': 'Применить',
      'mn': 'Өргөдөл гаргах',
    },
  },
  // offerToService
  {
    'ivfdej38': {
      'ru': 'Предложения по услуге',
      'mn': 'Үйлчилгээний санал',
    },
  },
  // transError
  {
    'beqfeb25': {
      'ru': 'ОШИБКА!\nповторите попытку позже',
      'mn': 'ERROR!\nдараа дахин оролдоно уу',
    },
    'guzhi5px': {
      'ru': 'Ок',
      'mn': 'OK',
    },
  },
  // incomeInfoAfterLink
  {
    '8pdt50lo': {
      'ru': 'Попытка:',
      'mn': 'оролдлого:',
    },
    'jm4d6ed2': {
      'ru': 'Проверяем оплату',
      'mn': 'Төлбөрийг шалгаж байна',
    },
  },
  // Miscellaneous
  {
    'cjg2zpl8': {
      'ru': 'Hello World',
      'mn': 'Сайн уу Дэлхий',
    },
    'utpdlvpm': {
      'ru': 'Далее',
      'mn': 'Дараа нь',
    },
    'm7sl9jac': {
      'ru': 'Hello World',
      'mn': 'Сайн уу Дэлхий',
    },
    'sg1cq23m': {
      'ru': 'Hello World',
      'mn': 'Сайн уу Дэлхий',
    },
    'zytuh7mw': {
      'ru': 'Hello World',
      'mn': 'Сайн уу Дэлхий',
    },
    'y7nv7h8v': {
      'ru': 'Hello World',
      'mn': 'Сайн уу Дэлхий',
    },
    'kudea7r5': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    '3bc2juae': {
      'ru': '+1 111 467 378 399',
      'mn': '+1 111 467 378 399',
    },
    'xa9s4nv3': {
      'ru': 'Hello World',
      'mn': 'Сайн уу Дэлхий',
    },
    '8nibwkfm': {
      'ru': 'Hello World',
      'mn': 'Сайн уу Дэлхий',
    },
    'xypiam1q': {
      'ru': 'Выслать код ещё раз',
      'mn': 'Кодоо дахин илгээнэ үү',
    },
    '2yvxwmf9': {
      'ru': 'Может быть позже',
      'mn': 'Магадгүй дараа нь',
    },
    'qzb52v9x': {
      'ru': 'Добро пожаловать!',
      'mn': 'Тавтай морил!',
    },
    'cpb9kx0s': {
      'ru': 'Отклик подтверждён заказчиком',
      'mn': 'Хариултыг үйлчлүүлэгч баталгаажуулсан.',
    },
    'qszx9l41': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    'klorr2vp': {
      'ru': '4.8',
      'mn': '4.8',
    },
    'ypr9z14c': {
      'ru': 'Введите',
      'mn': 'Оруулна уу',
    },
    't5gh3c4z': {
      'ru': '',
      'mn': '',
    },
    'ie44j4hj': {
      'ru': '',
      'mn': '',
    },
    'jkjzbzuj': {
      'ru': '',
      'mn': '',
    },
    'ggj6901k': {
      'ru': 'Пожалуйста дайте доступ к локации устройства',
      'mn': 'Төхөөрөмжийн байршилд хандах эрх өгнө үү',
    },
    'ril17gtd': {
      'ru': 'Разрешите приложению отправлять уведомления',
      'mn': 'Апп-д мэдэгдэл илгээхийг зөвшөөрнө үү',
    },
    'n0woqmpr': {
      'ru': '',
      'mn': '',
    },
    'cny7nvmp': {
      'ru': '',
      'mn': '',
    },
    'wojt9z0i': {
      'ru': '',
      'mn': '',
    },
    '9avsa2ts': {
      'ru': '',
      'mn': '',
    },
    'cc2gjj0y': {
      'ru': '',
      'mn': '',
    },
    '0x8ckzec': {
      'ru': '',
      'mn': '',
    },
    '4wnfifq8': {
      'ru': '',
      'mn': '',
    },
    '9lbbjgsb': {
      'ru': '',
      'mn': '',
    },
    'b2ey8u9g': {
      'ru': '',
      'mn': '',
    },
    'b5zc9qj1': {
      'ru': '',
      'mn': '',
    },
    'cx2n4k3h': {
      'ru': '',
      'mn': '',
    },
    '96wzoazx': {
      'ru': '',
      'mn': '',
    },
    'ci83wjum': {
      'ru': '',
      'mn': '',
    },
    'rg5adx8z': {
      'ru': '',
      'mn': '',
    },
    't721x05w': {
      'ru': '',
      'mn': '',
    },
    'wbqddf4r': {
      'ru': '',
      'mn': '',
    },
    'fnd102bo': {
      'ru': '',
      'mn': '',
    },
    '8qwwjb8p': {
      'ru': '',
      'mn': '',
    },
    'yk58l2y8': {
      'ru': '',
      'mn': '',
    },
    'hvivn85y': {
      'ru': '',
      'mn': '',
    },
    'rt31yur8': {
      'ru': '',
      'mn': '',
    },
    'jz6mbcw7': {
      'ru': '',
      'mn': '',
    },
    'fppjdw2b': {
      'ru': '',
      'mn': '',
    },
    'uis1rma1': {
      'ru': '',
      'mn': '',
    },
    'mhe0ffb6': {
      'ru': '',
      'mn': '',
    },
  },
].reduce((a, b) => a..addAll(b));
